FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_UOTGHS_COMPONENT_
#define _SAM_UOTGHS_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USB On-The-Go Interface */
/* ============================================================================= */
/** \addtogroup SAM_UOTGHS USB On-The-Go Interface */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief UotghsDevdma hardware registers */
    typedef struct
    {
        __IO uint32_t UOTGHS_DEVDMANXTDSC;  /**< \brief (UotghsDevdma Offset: 0x0) Device DMA Channel Next Descriptor Address Register */
        __IO uint32_t UOTGHS_DEVDMAADDRESS; /**< \brief (UotghsDevdma Offset: 0x4) Device DMA Channel Address Register */
        __IO uint32_t UOTGHS_DEVDMACONTROL; /**< \brief (UotghsDevdma Offset: 0x8) Device DMA Channel Control Register */
        __IO uint32_t UOTGHS_DEVDMASTATUS;  /**< \brief (UotghsDevdma Offset: 0xC) Device DMA Channel Status Register */
    } UotghsDevdma;
/** \brief UotghsHstdma hardware registers */
    typedef struct
    {
        __IO uint32_t UOTGHS_HSTDMANXTDSC;  /**< \brief (UotghsHstdma Offset: 0x0) Host DMA Channel Next Descriptor Address Register */
        __IO uint32_t UOTGHS_HSTDMAADDRESS; /**< \brief (UotghsHstdma Offset: 0x4) Host DMA Channel Address Register */
        __IO uint32_t UOTGHS_HSTDMACONTROL; /**< \brief (UotghsHstdma Offset: 0x8) Host DMA Channel Control Register */
        __IO uint32_t UOTGHS_HSTDMASTATUS;  /**< \brief (UotghsHstdma Offset: 0xC) Host DMA Channel Status Register */
    } UotghsHstdma;
/** \brief Uotghs hardware registers */
    #define UOTGHSDEVDMA_NUMBER    7
    #define UOTGHSHSTDMA_NUMBER    7
    typedef struct
    {
        __IO uint32_t UOTGHS_DEVCTRL;                      /**< \brief (Uotghs Offset: 0x0000) Device General Control Register */
        __I uint32_t UOTGHS_DEVISR;                        /**< \brief (Uotghs Offset: 0x0004) Device Global Interrupt Status Register */
        __O uint32_t UOTGHS_DEVICR;                        /**< \brief (Uotghs Offset: 0x0008) Device Global Interrupt Clear Register */
        __O uint32_t UOTGHS_DEVIFR;                        /**< \brief (Uotghs Offset: 0x000C) Device Global Interrupt Set Register */
        __I uint32_t UOTGHS_DEVIMR;                        /**< \brief (Uotghs Offset: 0x0010) Device Global Interrupt Mask Register */
        __O uint32_t UOTGHS_DEVIDR;                        /**< \brief (Uotghs Offset: 0x0014) Device Global Interrupt Disable Register */
        __O uint32_t UOTGHS_DEVIER;                        /**< \brief (Uotghs Offset: 0x0018) Device Global Interrupt Enable Register */
        __IO uint32_t UOTGHS_DEVEPT;                       /**< \brief (Uotghs Offset: 0x001C) Device Endpoint Register */
        __I uint32_t UOTGHS_DEVFNUM;                       /**< \brief (Uotghs Offset: 0x0020) Device Frame Number Register */
        __I uint32_t Reserved1[ 55 ];
        __IO uint32_t UOTGHS_DEVEPTCFG[ 12 ];              /**< \brief (Uotghs Offset: 0x100) Device Endpoint Configuration Register (n = 0) */
        __I uint32_t UOTGHS_DEVEPTISR[ 12 ];               /**< \brief (Uotghs Offset: 0x130) Device Endpoint Status Register (n = 0) */
        __O uint32_t UOTGHS_DEVEPTICR[ 12 ];               /**< \brief (Uotghs Offset: 0x160) Device Endpoint Clear Register (n = 0) */
        __O uint32_t UOTGHS_DEVEPTIFR[ 12 ];               /**< \brief (Uotghs Offset: 0x190) Device Endpoint Set Register (n = 0) */
        __I uint32_t UOTGHS_DEVEPTIMR[ 12 ];               /**< \brief (Uotghs Offset: 0x1C0) Device Endpoint Mask Register (n = 0) */
        __O uint32_t UOTGHS_DEVEPTIER[ 12 ];               /**< \brief (Uotghs Offset: 0x1F0) Device Endpoint Enable Register (n = 0) */
        __O uint32_t UOTGHS_DEVEPTIDR[ 12 ];               /**< \brief (Uotghs Offset: 0x220) Device Endpoint Disable Register (n = 0) */
        __I uint32_t Reserved2[ 48 ];
        UotghsDevdma UOTGHS_DEVDMA[ UOTGHSDEVDMA_NUMBER ]; /**< \brief (Uotghs Offset: 0x310) n = 1 .. 7 */
        __I uint32_t Reserved3[ 32 ];
        __IO uint32_t UOTGHS_HSTCTRL;                      /**< \brief (Uotghs Offset: 0x0400) Host General Control Register */
        __I uint32_t UOTGHS_HSTISR;                        /**< \brief (Uotghs Offset: 0x0404) Host Global Interrupt Status Register */
        __O uint32_t UOTGHS_HSTICR;                        /**< \brief (Uotghs Offset: 0x0408) Host Global Interrupt Clear Register */
        __O uint32_t UOTGHS_HSTIFR;                        /**< \brief (Uotghs Offset: 0x040C) Host Global Interrupt Set Register */
        __I uint32_t UOTGHS_HSTIMR;                        /**< \brief (Uotghs Offset: 0x0410) Host Global Interrupt Mask Register */
        __O uint32_t UOTGHS_HSTIDR;                        /**< \brief (Uotghs Offset: 0x0414) Host Global Interrupt Disable Register */
        __O uint32_t UOTGHS_HSTIER;                        /**< \brief (Uotghs Offset: 0x0418) Host Global Interrupt Enable Register */
        __IO uint32_t UOTGHS_HSTPIP;                       /**< \brief (Uotghs Offset: 0x0041C) Host Pipe Register */
        __IO uint32_t UOTGHS_HSTFNUM;                      /**< \brief (Uotghs Offset: 0x0420) Host Frame Number Register */
        __IO uint32_t UOTGHS_HSTADDR1;                     /**< \brief (Uotghs Offset: 0x0424) Host Address 1 Register */
        __IO uint32_t UOTGHS_HSTADDR2;                     /**< \brief (Uotghs Offset: 0x0428) Host Address 2 Register */
        __IO uint32_t UOTGHS_HSTADDR3;                     /**< \brief (Uotghs Offset: 0x042C) Host Address 3 Register */
        __I uint32_t Reserved4[ 52 ];
        __IO uint32_t UOTGHS_HSTPIPCFG[ 12 ];              /**< \brief (Uotghs Offset: 0x500) Host Pipe Configuration Register (n = 0) */
        __I uint32_t UOTGHS_HSTPIPISR[ 12 ];               /**< \brief (Uotghs Offset: 0x530) Host Pipe Status Register (n = 0) */
        __O uint32_t UOTGHS_HSTPIPICR[ 12 ];               /**< \brief (Uotghs Offset: 0x560) Host Pipe Clear Register (n = 0) */
        __O uint32_t UOTGHS_HSTPIPIFR[ 12 ];               /**< \brief (Uotghs Offset: 0x590) Host Pipe Set Register (n = 0) */
        __I uint32_t UOTGHS_HSTPIPIMR[ 12 ];               /**< \brief (Uotghs Offset: 0x5C0) Host Pipe Mask Register (n = 0) */
        __O uint32_t UOTGHS_HSTPIPIER[ 12 ];               /**< \brief (Uotghs Offset: 0x5F0) Host Pipe Enable Register (n = 0) */
        __O uint32_t UOTGHS_HSTPIPIDR[ 12 ];               /**< \brief (Uotghs Offset: 0x620) Host Pipe Disable Register (n = 0) */
        __IO uint32_t UOTGHS_HSTPIPINRQ[ 12 ];             /**< \brief (Uotghs Offset: 0x650) Host Pipe IN Request Register (n = 0) */
        __IO uint32_t UOTGHS_HSTPIPERR[ 12 ];              /**< \brief (Uotghs Offset: 0x680) Host Pipe Error Register (n = 0) */
        __I uint32_t Reserved5[ 24 ];
        UotghsHstdma UOTGHS_HSTDMA[ UOTGHSHSTDMA_NUMBER ]; /**< \brief (Uotghs Offset: 0x710) n = 1 .. 7 */
        __I uint32_t Reserved6[ 32 ];
        __IO uint32_t UOTGHS_CTRL;                         /**< \brief (Uotghs Offset: 0x0800) General Control Register */
        __I uint32_t UOTGHS_SR;                            /**< \brief (Uotghs Offset: 0x0804) General Status Register */
        __O uint32_t UOTGHS_SCR;                           /**< \brief (Uotghs Offset: 0x0808) General Status Clear Register */
        __O uint32_t UOTGHS_SFR;                           /**< \brief (Uotghs Offset: 0x080C) General Status Set Register */
        __IO uint32_t UOTGHS_TSTA1;                        /**< \brief (Uotghs Offset: 0x0810) General Test A1 Register */
        __IO uint32_t UOTGHS_TSTA2;                        /**< \brief (Uotghs Offset: 0x0814) General Test A2 Register */
        __I uint32_t UOTGHS_VERSION;                       /**< \brief (Uotghs Offset: 0x0818) General Version Register */
        __I uint32_t UOTGHS_FEATURES;                      /**< \brief (Uotghs Offset: 0x081C) General Features Register */
        __I uint32_t UOTGHS_ADDRSIZE;                      /**< \brief (Uotghs Offset: 0x0820) General APB Address Size Register */
        __I uint32_t UOTGHS_IPNAME1;                       /**< \brief (Uotghs Offset: 0x0824) General Name Register 1 */
        __I uint32_t UOTGHS_IPNAME2;                       /**< \brief (Uotghs Offset: 0x0828) General Name Register 2 */
        __I uint32_t UOTGHS_FSM;                           /**< \brief (Uotghs Offset: 0x082C) General Finite State Machine Register */
    } Uotghs;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- UOTGHS_DEVCTRL : (UOTGHS Offset: 0x0000) Device General Control Register -------- */
#define UOTGHS_DEVCTRL_UADD_Pos                          0
#define UOTGHS_DEVCTRL_UADD_Msk                          ( 0x7fu << UOTGHS_DEVCTRL_UADD_Pos )   /**< \brief (UOTGHS_DEVCTRL) USB Address */
#define UOTGHS_DEVCTRL_UADD( value )    ( ( UOTGHS_DEVCTRL_UADD_Msk & ( ( value ) << UOTGHS_DEVCTRL_UADD_Pos ) ) )
#define UOTGHS_DEVCTRL_ADDEN                             ( 0x1u << 7 )                          /**< \brief (UOTGHS_DEVCTRL) Address Enable */
#define UOTGHS_DEVCTRL_DETACH                            ( 0x1u << 8 )                          /**< \brief (UOTGHS_DEVCTRL) Detach */
#define UOTGHS_DEVCTRL_RMWKUP                            ( 0x1u << 9 )                          /**< \brief (UOTGHS_DEVCTRL) Remote Wake-Up */
#define UOTGHS_DEVCTRL_SPDCONF_Pos                       10
#define UOTGHS_DEVCTRL_SPDCONF_Msk                       ( 0x3u << UOTGHS_DEVCTRL_SPDCONF_Pos ) /**< \brief (UOTGHS_DEVCTRL) Mode Configuration */
#define   UOTGHS_DEVCTRL_SPDCONF_NORMAL                  ( 0x0u << 10 )                         /**< \brief (UOTGHS_DEVCTRL) The peripheral starts in full-speed mode and performs a high-speed reset to switch to the high-speed mode if the host is high-speed capable. */
#define   UOTGHS_DEVCTRL_SPDCONF_LOW_POWER               ( 0x1u << 10 )                         /**< \brief (UOTGHS_DEVCTRL) For a better consumption, if high-speed is not needed. */
#define   UOTGHS_DEVCTRL_SPDCONF_HIGH_SPEED              ( 0x2u << 10 )                         /**< \brief (UOTGHS_DEVCTRL) Forced high speed. */
#define   UOTGHS_DEVCTRL_SPDCONF_FORCED_FS               ( 0x3u << 10 )                         /**< \brief (UOTGHS_DEVCTRL) The peripheral remains in full-speed mode whatever the host speed capability. */
#define UOTGHS_DEVCTRL_LS                                ( 0x1u << 12 )                         /**< \brief (UOTGHS_DEVCTRL) Low-Speed Mode Force */
#define UOTGHS_DEVCTRL_TSTJ                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_DEVCTRL) Test mode J */
#define UOTGHS_DEVCTRL_TSTK                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_DEVCTRL) Test mode K */
#define UOTGHS_DEVCTRL_TSTPCKT                           ( 0x1u << 15 )                         /**< \brief (UOTGHS_DEVCTRL) Test packet mode */
#define UOTGHS_DEVCTRL_OPMODE2                           ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVCTRL) Specific Operational mode */
/* -------- UOTGHS_DEVISR : (UOTGHS Offset: 0x0004) Device Global Interrupt Status Register -------- */
#define UOTGHS_DEVISR_SUSP                               ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVISR) Suspend Interrupt */
#define UOTGHS_DEVISR_MSOF                               ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVISR) Micro Start of Frame Interrupt */
#define UOTGHS_DEVISR_SOF                                ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVISR) Start of Frame Interrupt */
#define UOTGHS_DEVISR_EORST                              ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVISR) End of Reset Interrupt */
#define UOTGHS_DEVISR_WAKEUP                             ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVISR) Wake-Up Interrupt */
#define UOTGHS_DEVISR_EORSM                              ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVISR) End of Resume Interrupt */
#define UOTGHS_DEVISR_UPRSM                              ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVISR) Upstream Resume Interrupt */
#define UOTGHS_DEVISR_PEP_0                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 0 Interrupt */
#define UOTGHS_DEVISR_PEP_1                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 1 Interrupt */
#define UOTGHS_DEVISR_PEP_2                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 2 Interrupt */
#define UOTGHS_DEVISR_PEP_3                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 3 Interrupt */
#define UOTGHS_DEVISR_PEP_4                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 4 Interrupt */
#define UOTGHS_DEVISR_PEP_5                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 5 Interrupt */
#define UOTGHS_DEVISR_PEP_6                              ( 0x1u << 18 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 6 Interrupt */
#define UOTGHS_DEVISR_PEP_7                              ( 0x1u << 19 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 7 Interrupt */
#define UOTGHS_DEVISR_PEP_8                              ( 0x1u << 20 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 8 Interrupt */
#define UOTGHS_DEVISR_PEP_9                              ( 0x1u << 21 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 9 Interrupt */
#define UOTGHS_DEVISR_PEP_10                             ( 0x1u << 22 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 10 Interrupt */
#define UOTGHS_DEVISR_PEP_11                             ( 0x1u << 23 )                         /**< \brief (UOTGHS_DEVISR) Endpoint 11 Interrupt */
#define UOTGHS_DEVISR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 1 Interrupt */
#define UOTGHS_DEVISR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 2 Interrupt */
#define UOTGHS_DEVISR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 3 Interrupt */
#define UOTGHS_DEVISR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 4 Interrupt */
#define UOTGHS_DEVISR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 5 Interrupt */
#define UOTGHS_DEVISR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 6 Interrupt */
#define UOTGHS_DEVISR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_DEVISR) DMA Channel 7 Interrupt */
/* -------- UOTGHS_DEVICR : (UOTGHS Offset: 0x0008) Device Global Interrupt Clear Register -------- */
#define UOTGHS_DEVICR_SUSPC                              ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVICR) Suspend Interrupt Clear */
#define UOTGHS_DEVICR_MSOFC                              ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVICR) Micro Start of Frame Interrupt Clear */
#define UOTGHS_DEVICR_SOFC                               ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVICR) Start of Frame Interrupt Clear */
#define UOTGHS_DEVICR_EORSTC                             ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVICR) End of Reset Interrupt Clear */
#define UOTGHS_DEVICR_WAKEUPC                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVICR) Wake-Up Interrupt Clear */
#define UOTGHS_DEVICR_EORSMC                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVICR) End of Resume Interrupt Clear */
#define UOTGHS_DEVICR_UPRSMC                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVICR) Upstream Resume Interrupt Clear */
/* -------- UOTGHS_DEVIFR : (UOTGHS Offset: 0x000C) Device Global Interrupt Set Register -------- */
#define UOTGHS_DEVIFR_SUSPS                              ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVIFR) Suspend Interrupt Set */
#define UOTGHS_DEVIFR_MSOFS                              ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVIFR) Micro Start of Frame Interrupt Set */
#define UOTGHS_DEVIFR_SOFS                               ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVIFR) Start of Frame Interrupt Set */
#define UOTGHS_DEVIFR_EORSTS                             ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVIFR) End of Reset Interrupt Set */
#define UOTGHS_DEVIFR_WAKEUPS                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVIFR) Wake-Up Interrupt Set */
#define UOTGHS_DEVIFR_EORSMS                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVIFR) End of Resume Interrupt Set */
#define UOTGHS_DEVIFR_UPRSMS                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVIFR) Upstream Resume Interrupt Set */
#define UOTGHS_DEVIFR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 1 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 2 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 3 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 4 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 5 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 6 Interrupt Set */
#define UOTGHS_DEVIFR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_DEVIFR) DMA Channel 7 Interrupt Set */
/* -------- UOTGHS_DEVIMR : (UOTGHS Offset: 0x0010) Device Global Interrupt Mask Register -------- */
#define UOTGHS_DEVIMR_SUSPE                              ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVIMR) Suspend Interrupt Mask */
#define UOTGHS_DEVIMR_MSOFE                              ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVIMR) Micro Start of Frame Interrupt Mask */
#define UOTGHS_DEVIMR_SOFE                               ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVIMR) Start of Frame Interrupt Mask */
#define UOTGHS_DEVIMR_EORSTE                             ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVIMR) End of Reset Interrupt Mask */
#define UOTGHS_DEVIMR_WAKEUPE                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVIMR) Wake-Up Interrupt Mask */
#define UOTGHS_DEVIMR_EORSME                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVIMR) End of Resume Interrupt Mask */
#define UOTGHS_DEVIMR_UPRSME                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVIMR) Upstream Resume Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_0                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 0 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_1                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 1 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_2                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 2 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_3                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 3 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_4                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 4 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_5                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 5 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_6                              ( 0x1u << 18 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 6 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_7                              ( 0x1u << 19 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 7 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_8                              ( 0x1u << 20 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 8 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_9                              ( 0x1u << 21 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 9 Interrupt Mask */
#define UOTGHS_DEVIMR_PEP_10                             ( 0x1u << 22 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 10 Interrupt Mask */
