FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
#define UOTGHS_DEVIMR_PEP_11                             ( 0x1u << 23 )                         /**< \brief (UOTGHS_DEVIMR) Endpoint 11 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 1 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 2 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 3 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 4 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 5 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 6 Interrupt Mask */
#define UOTGHS_DEVIMR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_DEVIMR) DMA Channel 7 Interrupt Mask */
/* -------- UOTGHS_DEVIDR : (UOTGHS Offset: 0x0014) Device Global Interrupt Disable Register -------- */
#define UOTGHS_DEVIDR_SUSPEC                             ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVIDR) Suspend Interrupt Disable */
#define UOTGHS_DEVIDR_MSOFEC                             ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVIDR) Micro Start of Frame Interrupt Disable */
#define UOTGHS_DEVIDR_SOFEC                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVIDR) Start of Frame Interrupt Disable */
#define UOTGHS_DEVIDR_EORSTEC                            ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVIDR) End of Reset Interrupt Disable */
#define UOTGHS_DEVIDR_WAKEUPEC                           ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVIDR) Wake-Up Interrupt Disable */
#define UOTGHS_DEVIDR_EORSMEC                            ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVIDR) End of Resume Interrupt Disable */
#define UOTGHS_DEVIDR_UPRSMEC                            ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVIDR) Upstream Resume Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_0                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 0 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_1                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 1 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_2                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 2 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_3                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 3 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_4                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 4 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_5                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 5 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_6                              ( 0x1u << 18 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 6 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_7                              ( 0x1u << 19 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 7 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_8                              ( 0x1u << 20 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 8 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_9                              ( 0x1u << 21 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 9 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_10                             ( 0x1u << 22 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 10 Interrupt Disable */
#define UOTGHS_DEVIDR_PEP_11                             ( 0x1u << 23 )                         /**< \brief (UOTGHS_DEVIDR) Endpoint 11 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 1 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 2 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 3 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 4 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 5 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 6 Interrupt Disable */
#define UOTGHS_DEVIDR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_DEVIDR) DMA Channel 7 Interrupt Disable */
/* -------- UOTGHS_DEVIER : (UOTGHS Offset: 0x0018) Device Global Interrupt Enable Register -------- */
#define UOTGHS_DEVIER_SUSPES                             ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVIER) Suspend Interrupt Enable */
#define UOTGHS_DEVIER_MSOFES                             ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVIER) Micro Start of Frame Interrupt Enable */
#define UOTGHS_DEVIER_SOFES                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVIER) Start of Frame Interrupt Enable */
#define UOTGHS_DEVIER_EORSTES                            ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVIER) End of Reset Interrupt Enable */
#define UOTGHS_DEVIER_WAKEUPES                           ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVIER) Wake-Up Interrupt Enable */
#define UOTGHS_DEVIER_EORSMES                            ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVIER) End of Resume Interrupt Enable */
#define UOTGHS_DEVIER_UPRSMES                            ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVIER) Upstream Resume Interrupt Enable */
#define UOTGHS_DEVIER_PEP_0                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 0 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_1                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 1 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_2                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 2 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_3                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 3 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_4                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 4 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_5                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 5 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_6                              ( 0x1u << 18 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 6 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_7                              ( 0x1u << 19 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 7 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_8                              ( 0x1u << 20 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 8 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_9                              ( 0x1u << 21 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 9 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_10                             ( 0x1u << 22 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 10 Interrupt Enable */
#define UOTGHS_DEVIER_PEP_11                             ( 0x1u << 23 )                         /**< \brief (UOTGHS_DEVIER) Endpoint 11 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 1 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 2 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 3 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 4 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 5 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 6 Interrupt Enable */
#define UOTGHS_DEVIER_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_DEVIER) DMA Channel 7 Interrupt Enable */
/* -------- UOTGHS_DEVEPT : (UOTGHS Offset: 0x001C) Device Endpoint Register -------- */
#define UOTGHS_DEVEPT_EPEN0                              ( 0x1u << 0 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 0 Enable */
#define UOTGHS_DEVEPT_EPEN1                              ( 0x1u << 1 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 1 Enable */
#define UOTGHS_DEVEPT_EPEN2                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 2 Enable */
#define UOTGHS_DEVEPT_EPEN3                              ( 0x1u << 3 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 3 Enable */
#define UOTGHS_DEVEPT_EPEN4                              ( 0x1u << 4 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 4 Enable */
#define UOTGHS_DEVEPT_EPEN5                              ( 0x1u << 5 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 5 Enable */
#define UOTGHS_DEVEPT_EPEN6                              ( 0x1u << 6 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 6 Enable */
#define UOTGHS_DEVEPT_EPEN7                              ( 0x1u << 7 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 7 Enable */
#define UOTGHS_DEVEPT_EPEN8                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_DEVEPT) Endpoint 8 Enable */
#define UOTGHS_DEVEPT_EPRST0                             ( 0x1u << 16 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 0 Reset */
#define UOTGHS_DEVEPT_EPRST1                             ( 0x1u << 17 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 1 Reset */
#define UOTGHS_DEVEPT_EPRST2                             ( 0x1u << 18 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 2 Reset */
#define UOTGHS_DEVEPT_EPRST3                             ( 0x1u << 19 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 3 Reset */
#define UOTGHS_DEVEPT_EPRST4                             ( 0x1u << 20 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 4 Reset */
#define UOTGHS_DEVEPT_EPRST5                             ( 0x1u << 21 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 5 Reset */
#define UOTGHS_DEVEPT_EPRST6                             ( 0x1u << 22 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 6 Reset */
#define UOTGHS_DEVEPT_EPRST7                             ( 0x1u << 23 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 7 Reset */
#define UOTGHS_DEVEPT_EPRST8                             ( 0x1u << 24 )                         /**< \brief (UOTGHS_DEVEPT) Endpoint 8 Reset */
/* -------- UOTGHS_DEVFNUM : (UOTGHS Offset: 0x0020) Device Frame Number Register -------- */
#define UOTGHS_DEVFNUM_MFNUM_Pos                         0
#define UOTGHS_DEVFNUM_MFNUM_Msk                         ( 0x7u << UOTGHS_DEVFNUM_MFNUM_Pos )     /**< \brief (UOTGHS_DEVFNUM) Micro Frame Number */
#define UOTGHS_DEVFNUM_FNUM_Pos                          3
#define UOTGHS_DEVFNUM_FNUM_Msk                          ( 0x7ffu << UOTGHS_DEVFNUM_FNUM_Pos )    /**< \brief (UOTGHS_DEVFNUM) Frame Number */
#define UOTGHS_DEVFNUM_FNCERR                            ( 0x1u << 15 )                           /**< \brief (UOTGHS_DEVFNUM) Frame Number CRC Error */
/* -------- UOTGHS_DEVEPTCFG[12] : (UOTGHS Offset: 0x100) Device Endpoint Configuration Register (n = 0) -------- */
#define UOTGHS_DEVEPTCFG_ALLOC                           ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Endpoint Memory Allocate */
#define UOTGHS_DEVEPTCFG_EPBK_Pos                        2
#define UOTGHS_DEVEPTCFG_EPBK_Msk                        ( 0x3u << UOTGHS_DEVEPTCFG_EPBK_Pos )    /**< \brief (UOTGHS_DEVEPTCFG[12]) Endpoint Banks */
#define   UOTGHS_DEVEPTCFG_EPBK_1_BANK                   ( 0x0u << 2 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Single-bank endpoint */
#define   UOTGHS_DEVEPTCFG_EPBK_2_BANK                   ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Double-bank endpoint */
#define   UOTGHS_DEVEPTCFG_EPBK_3_BANK                   ( 0x2u << 2 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Triple-bank endpoint */
#define UOTGHS_DEVEPTCFG_EPSIZE_Pos                      4
#define UOTGHS_DEVEPTCFG_EPSIZE_Msk                      ( 0x7u << UOTGHS_DEVEPTCFG_EPSIZE_Pos )  /**< \brief (UOTGHS_DEVEPTCFG[12]) Endpoint Size */
#define   UOTGHS_DEVEPTCFG_EPSIZE_8_BYTE                 ( 0x0u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 8 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_16_BYTE                ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 16 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_32_BYTE                ( 0x2u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 32 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_64_BYTE                ( 0x3u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 64 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_128_BYTE               ( 0x4u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 128 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_256_BYTE               ( 0x5u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 256 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_512_BYTE               ( 0x6u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 512 bytes */
#define   UOTGHS_DEVEPTCFG_EPSIZE_1024_BYTE              ( 0x7u << 4 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) 1024 bytes */
#define UOTGHS_DEVEPTCFG_EPDIR                           ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Endpoint Direction */
#define   UOTGHS_DEVEPTCFG_EPDIR_OUT                     ( 0x0u << 8 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) The endpoint direction is OUT. */
#define   UOTGHS_DEVEPTCFG_EPDIR_IN                      ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) The endpoint direction is IN (nor for control endpoints). */
#define UOTGHS_DEVEPTCFG_AUTOSW                          ( 0x1u << 9 )                            /**< \brief (UOTGHS_DEVEPTCFG[12]) Automatic Switch */
#define UOTGHS_DEVEPTCFG_EPTYPE_Pos                      11
#define UOTGHS_DEVEPTCFG_EPTYPE_Msk                      ( 0x3u << UOTGHS_DEVEPTCFG_EPTYPE_Pos )  /**< \brief (UOTGHS_DEVEPTCFG[12]) Endpoint Type */
#define   UOTGHS_DEVEPTCFG_EPTYPE_CTRL                   ( 0x0u << 11 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) Control */
#define   UOTGHS_DEVEPTCFG_EPTYPE_ISO                    ( 0x1u << 11 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) Isochronous */
#define   UOTGHS_DEVEPTCFG_EPTYPE_BLK                    ( 0x2u << 11 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) Bulk */
#define   UOTGHS_DEVEPTCFG_EPTYPE_INTRPT                 ( 0x3u << 11 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) Interrupt */
#define UOTGHS_DEVEPTCFG_NBTRANS_Pos                     13
#define UOTGHS_DEVEPTCFG_NBTRANS_Msk                     ( 0x3u << UOTGHS_DEVEPTCFG_NBTRANS_Pos ) /**< \brief (UOTGHS_DEVEPTCFG[12]) Number of transaction per microframe for isochronous endpoint */
#define   UOTGHS_DEVEPTCFG_NBTRANS_0_TRANS               ( 0x0u << 13 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) reserved to endpoint that does not have the high-bandwidth isochronous capability. */
#define   UOTGHS_DEVEPTCFG_NBTRANS_1_TRANS               ( 0x1u << 13 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) default value: one transaction per micro-frame. */
#define   UOTGHS_DEVEPTCFG_NBTRANS_2_TRANS               ( 0x2u << 13 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) 2 transactions per micro-frame. This endpoint should be configured as double-bank. */
#define   UOTGHS_DEVEPTCFG_NBTRANS_3_TRANS               ( 0x3u << 13 )                           /**< \brief (UOTGHS_DEVEPTCFG[12]) 3 transactions per micro-frame. This endpoint should be configured as triple-bank. */
/* -------- UOTGHS_DEVEPTISR[12] : (UOTGHS Offset: 0x130) Device Endpoint Status Register (n = 0) -------- */
#define UOTGHS_DEVEPTISR_TXINI                           ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Transmitted IN Data Interrupt */
#define UOTGHS_DEVEPTISR_RXOUTI                          ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Received OUT Data Interrupt */
#define UOTGHS_DEVEPTISR_RXSTPI                          ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Received SETUP Interrupt */
#define UOTGHS_DEVEPTISR_NAKOUTI                         ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) NAKed OUT Interrupt */
#define UOTGHS_DEVEPTISR_NAKINI                          ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) NAKed IN Interrupt */
#define UOTGHS_DEVEPTISR_OVERFI                          ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Overflow Interrupt */
#define UOTGHS_DEVEPTISR_STALLEDI                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) STALLed Interrupt */
#define UOTGHS_DEVEPTISR_SHORTPACKET                     ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Short Packet Interrupt */
#define UOTGHS_DEVEPTISR_DTSEQ_Pos                       8
#define UOTGHS_DEVEPTISR_DTSEQ_Msk                       ( 0x3u << UOTGHS_DEVEPTISR_DTSEQ_Pos )   /**< \brief (UOTGHS_DEVEPTISR[12]) Data Toggle Sequence */
#define   UOTGHS_DEVEPTISR_DTSEQ_DATA0                   ( 0x0u << 8 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Data0 toggle sequence */
#define   UOTGHS_DEVEPTISR_DTSEQ_DATA1                   ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Data1 toggle sequence */
#define   UOTGHS_DEVEPTISR_DTSEQ_DATA2                   ( 0x2u << 8 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Reserved for high-bandwidth isochronous endpoint */
#define   UOTGHS_DEVEPTISR_DTSEQ_MDATA                   ( 0x3u << 8 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Reserved for high-bandwidth isochronous endpoint */
#define UOTGHS_DEVEPTISR_NBUSYBK_Pos                     12
#define UOTGHS_DEVEPTISR_NBUSYBK_Msk                     ( 0x3u << UOTGHS_DEVEPTISR_NBUSYBK_Pos ) /**< \brief (UOTGHS_DEVEPTISR[12]) Number of Busy Banks */
#define   UOTGHS_DEVEPTISR_NBUSYBK_0_BUSY                ( 0x0u << 12 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) 0 busy bank (all banks free) */
#define   UOTGHS_DEVEPTISR_NBUSYBK_1_BUSY                ( 0x1u << 12 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) 1 busy bank */
#define   UOTGHS_DEVEPTISR_NBUSYBK_2_BUSY                ( 0x2u << 12 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) 2 busy banks */
#define   UOTGHS_DEVEPTISR_NBUSYBK_3_BUSY                ( 0x3u << 12 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) 3 busy banks */
#define UOTGHS_DEVEPTISR_CURRBK_Pos                      14
#define UOTGHS_DEVEPTISR_CURRBK_Msk                      ( 0x3u << UOTGHS_DEVEPTISR_CURRBK_Pos )  /**< \brief (UOTGHS_DEVEPTISR[12]) Current Bank */
#define   UOTGHS_DEVEPTISR_CURRBK_BANK0                  ( 0x0u << 14 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Current bank is bank0 */
#define   UOTGHS_DEVEPTISR_CURRBK_BANK1                  ( 0x1u << 14 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Current bank is bank1 */
#define   UOTGHS_DEVEPTISR_CURRBK_BANK2                  ( 0x2u << 14 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Current bank is bank2 */
#define UOTGHS_DEVEPTISR_RWALL                           ( 0x1u << 16 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Read-write Allowed */
#define UOTGHS_DEVEPTISR_CTRLDIR                         ( 0x1u << 17 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Control Direction */
#define UOTGHS_DEVEPTISR_CFGOK                           ( 0x1u << 18 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) Configuration OK Status */
#define UOTGHS_DEVEPTISR_BYCT_Pos                        20
#define UOTGHS_DEVEPTISR_BYCT_Msk                        ( 0x7ffu << UOTGHS_DEVEPTISR_BYCT_Pos )  /**< \brief (UOTGHS_DEVEPTISR[12]) Byte Count */
#define UOTGHS_DEVEPTISR_UNDERFI                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) Underflow Interrupt */
#define UOTGHS_DEVEPTISR_HBISOINERRI                     ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) High Bandwidth Isochronous IN Underflow Error Interrupt */
#define UOTGHS_DEVEPTISR_HBISOFLUSHI                     ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) High Bandwidth Isochronous IN Flush Interrupt */
#define UOTGHS_DEVEPTISR_CRCERRI                         ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTISR[12]) CRC Error Interrupt */
#define UOTGHS_DEVEPTISR_ERRORTRANS                      ( 0x1u << 10 )                           /**< \brief (UOTGHS_DEVEPTISR[12]) High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt */
/* -------- UOTGHS_DEVEPTICR[12] : (UOTGHS Offset: 0x160) Device Endpoint Clear Register (n = 0) -------- */
#define UOTGHS_DEVEPTICR_TXINIC                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Transmitted IN Data Interrupt Clear */
#define UOTGHS_DEVEPTICR_RXOUTIC                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Received OUT Data Interrupt Clear */
#define UOTGHS_DEVEPTICR_RXSTPIC                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Received SETUP Interrupt Clear */
#define UOTGHS_DEVEPTICR_NAKOUTIC                        ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) NAKed OUT Interrupt Clear */
