FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
#define UOTGHS_DEVEPTICR_NAKINIC                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) NAKed IN Interrupt Clear */
#define UOTGHS_DEVEPTICR_OVERFIC                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Overflow Interrupt Clear */
#define UOTGHS_DEVEPTICR_STALLEDIC                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) STALLed Interrupt Clear */
#define UOTGHS_DEVEPTICR_SHORTPACKETC                    ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Short Packet Interrupt Clear */
#define UOTGHS_DEVEPTICR_UNDERFIC                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) Underflow Interrupt Clear */
#define UOTGHS_DEVEPTICR_HBISOINERRIC                    ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) High bandwidth isochronous IN Underflow Error Interrupt Clear */
#define UOTGHS_DEVEPTICR_HBISOFLUSHIC                    ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) High Bandwidth Isochronous IN Flush Interrupt Clear */
#define UOTGHS_DEVEPTICR_CRCERRIC                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTICR[12]) CRC Error Interrupt Clear */
/* -------- UOTGHS_DEVEPTIFR[12] : (UOTGHS Offset: 0x190) Device Endpoint Set Register (n = 0) -------- */
#define UOTGHS_DEVEPTIFR_TXINIS                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Transmitted IN Data Interrupt Set */
#define UOTGHS_DEVEPTIFR_RXOUTIS                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Received OUT Data Interrupt Set */
#define UOTGHS_DEVEPTIFR_RXSTPIS                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Received SETUP Interrupt Set */
#define UOTGHS_DEVEPTIFR_NAKOUTIS                        ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) NAKed OUT Interrupt Set */
#define UOTGHS_DEVEPTIFR_NAKINIS                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) NAKed IN Interrupt Set */
#define UOTGHS_DEVEPTIFR_OVERFIS                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Overflow Interrupt Set */
#define UOTGHS_DEVEPTIFR_STALLEDIS                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) STALLed Interrupt Set */
#define UOTGHS_DEVEPTIFR_SHORTPACKETS                    ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Short Packet Interrupt Set */
#define UOTGHS_DEVEPTIFR_NBUSYBKS                        ( 0x1u << 12 )                           /**< \brief (UOTGHS_DEVEPTIFR[12]) Number of Busy Banks Interrupt Set */
#define UOTGHS_DEVEPTIFR_UNDERFIS                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) Underflow Interrupt Set */
#define UOTGHS_DEVEPTIFR_HBISOINERRIS                    ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) High bandwidth isochronous IN Underflow Error Interrupt Set */
#define UOTGHS_DEVEPTIFR_HBISOFLUSHIS                    ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) High Bandwidth Isochronous IN Flush Interrupt Set */
#define UOTGHS_DEVEPTIFR_CRCERRIS                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIFR[12]) CRC Error Interrupt Set */
/* -------- UOTGHS_DEVEPTIMR[12] : (UOTGHS Offset: 0x1C0) Device Endpoint Mask Register (n = 0) -------- */
#define UOTGHS_DEVEPTIMR_TXINE                           ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Transmitted IN Data Interrupt */
#define UOTGHS_DEVEPTIMR_RXOUTE                          ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Received OUT Data Interrupt */
#define UOTGHS_DEVEPTIMR_RXSTPE                          ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Received SETUP Interrupt */
#define UOTGHS_DEVEPTIMR_NAKOUTE                         ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) NAKed OUT Interrupt */
#define UOTGHS_DEVEPTIMR_NAKINE                          ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) NAKed IN Interrupt */
#define UOTGHS_DEVEPTIMR_OVERFE                          ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Overflow Interrupt */
#define UOTGHS_DEVEPTIMR_STALLEDE                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) STALLed Interrupt */
#define UOTGHS_DEVEPTIMR_SHORTPACKETE                    ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Short Packet Interrupt */
#define UOTGHS_DEVEPTIMR_NBUSYBKE                        ( 0x1u << 12 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) Number of Busy Banks Interrupt */
#define UOTGHS_DEVEPTIMR_KILLBK                          ( 0x1u << 13 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) Kill IN Bank */
#define UOTGHS_DEVEPTIMR_FIFOCON                         ( 0x1u << 14 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) FIFO Control */
#define UOTGHS_DEVEPTIMR_EPDISHDMA                       ( 0x1u << 16 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) Endpoint Interrupts Disable HDMA Request */
#define UOTGHS_DEVEPTIMR_NYETDIS                         ( 0x1u << 17 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) NYET Token Disable */
#define UOTGHS_DEVEPTIMR_RSTDT                           ( 0x1u << 18 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) Reset Data Toggle */
#define UOTGHS_DEVEPTIMR_STALLRQ                         ( 0x1u << 19 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) STALL Request */
#define UOTGHS_DEVEPTIMR_UNDERFE                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) Underflow Interrupt */
#define UOTGHS_DEVEPTIMR_HBISOINERRE                     ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) High Bandwidth Isochronous IN Error Interrupt */
#define UOTGHS_DEVEPTIMR_HBISOFLUSHE                     ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) High Bandwidth Isochronous IN Flush Interrupt */
#define UOTGHS_DEVEPTIMR_CRCERRE                         ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) CRC Error Interrupt */
#define UOTGHS_DEVEPTIMR_MDATAE                          ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) MData Interrupt */
#define UOTGHS_DEVEPTIMR_DATAXE                          ( 0x1u << 9 )                            /**< \brief (UOTGHS_DEVEPTIMR[12]) DataX Interrupt */
#define UOTGHS_DEVEPTIMR_ERRORTRANSE                     ( 0x1u << 10 )                           /**< \brief (UOTGHS_DEVEPTIMR[12]) Transaction Error Interrupt */
/* -------- UOTGHS_DEVEPTIER[12] : (UOTGHS Offset: 0x1F0) Device Endpoint Enable Register (n = 0) -------- */
#define UOTGHS_DEVEPTIER_TXINES                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Transmitted IN Data Interrupt Enable */
#define UOTGHS_DEVEPTIER_RXOUTES                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Received OUT Data Interrupt Enable */
#define UOTGHS_DEVEPTIER_RXSTPES                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Received SETUP Interrupt Enable */
#define UOTGHS_DEVEPTIER_NAKOUTES                        ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) NAKed OUT Interrupt Enable */
#define UOTGHS_DEVEPTIER_NAKINES                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) NAKed IN Interrupt Enable */
#define UOTGHS_DEVEPTIER_OVERFES                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Overflow Interrupt Enable */
#define UOTGHS_DEVEPTIER_STALLEDES                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) STALLed Interrupt Enable */
#define UOTGHS_DEVEPTIER_SHORTPACKETES                   ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Short Packet Interrupt Enable */
#define UOTGHS_DEVEPTIER_NBUSYBKES                       ( 0x1u << 12 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) Number of Busy Banks Interrupt Enable */
#define UOTGHS_DEVEPTIER_KILLBKS                         ( 0x1u << 13 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) Kill IN Bank */
#define UOTGHS_DEVEPTIER_FIFOCONS                        ( 0x1u << 14 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) FIFO Control */
#define UOTGHS_DEVEPTIER_EPDISHDMAS                      ( 0x1u << 16 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) Endpoint Interrupts Disable HDMA Request Enable */
#define UOTGHS_DEVEPTIER_NYETDISS                        ( 0x1u << 17 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) NYET Token Disable Enable */
#define UOTGHS_DEVEPTIER_RSTDTS                          ( 0x1u << 18 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) Reset Data Toggle Enable */
#define UOTGHS_DEVEPTIER_STALLRQS                        ( 0x1u << 19 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) STALL Request Enable */
#define UOTGHS_DEVEPTIER_UNDERFES                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) Underflow Interrupt Enable */
#define UOTGHS_DEVEPTIER_HBISOINERRES                    ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) High Bandwidth Isochronous IN Error Interrupt Enable */
#define UOTGHS_DEVEPTIER_HBISOFLUSHES                    ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) High Bandwidth Isochronous IN Flush Interrupt Enable */
#define UOTGHS_DEVEPTIER_CRCERRES                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) CRC Error Interrupt Enable */
#define UOTGHS_DEVEPTIER_MDATAES                         ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) MData Interrupt Enable */
#define UOTGHS_DEVEPTIER_DATAXES                         ( 0x1u << 9 )                            /**< \brief (UOTGHS_DEVEPTIER[12]) DataX Interrupt Enable */
#define UOTGHS_DEVEPTIER_ERRORTRANSES                    ( 0x1u << 10 )                           /**< \brief (UOTGHS_DEVEPTIER[12]) Transaction Error Interrupt Enable */
/* -------- UOTGHS_DEVEPTIDR[12] : (UOTGHS Offset: 0x220) Device Endpoint Disable Register (n = 0) -------- */
#define UOTGHS_DEVEPTIDR_TXINEC                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Transmitted IN Interrupt Clear */
#define UOTGHS_DEVEPTIDR_RXOUTEC                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Received OUT Data Interrupt Clear */
#define UOTGHS_DEVEPTIDR_RXSTPEC                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Received SETUP Interrupt Clear */
#define UOTGHS_DEVEPTIDR_NAKOUTEC                        ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) NAKed OUT Interrupt Clear */
#define UOTGHS_DEVEPTIDR_NAKINEC                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) NAKed IN Interrupt Clear */
#define UOTGHS_DEVEPTIDR_OVERFEC                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Overflow Interrupt Clear */
#define UOTGHS_DEVEPTIDR_STALLEDEC                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) STALLed Interrupt Clear */
#define UOTGHS_DEVEPTIDR_SHORTPACKETEC                   ( 0x1u << 7 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Shortpacket Interrupt Clear */
#define UOTGHS_DEVEPTIDR_NBUSYBKEC                       ( 0x1u << 12 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) Number of Busy Banks Interrupt Clear */
#define UOTGHS_DEVEPTIDR_FIFOCONC                        ( 0x1u << 14 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) FIFO Control Clear */
#define UOTGHS_DEVEPTIDR_EPDISHDMAC                      ( 0x1u << 16 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) Endpoint Interrupts Disable HDMA Request Clear */
#define UOTGHS_DEVEPTIDR_NYETDISC                        ( 0x1u << 17 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) NYET Token Disable Clear */
#define UOTGHS_DEVEPTIDR_STALLRQC                        ( 0x1u << 19 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) STALL Request Clear */
#define UOTGHS_DEVEPTIDR_UNDERFEC                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) Underflow Interrupt Clear */
#define UOTGHS_DEVEPTIDR_HBISOINERREC                    ( 0x1u << 3 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) High Bandwidth Isochronous IN Error Interrupt Clear */
#define UOTGHS_DEVEPTIDR_HBISOFLUSHEC                    ( 0x1u << 4 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) High Bandwidth Isochronous IN Flush Interrupt Clear */
#define UOTGHS_DEVEPTIDR_CRCERREC                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) CRC Error Interrupt Clear */
#define UOTGHS_DEVEPTIDR_MDATEC                          ( 0x1u << 8 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) MData Interrupt Clear */
#define UOTGHS_DEVEPTIDR_DATAXEC                         ( 0x1u << 9 )                            /**< \brief (UOTGHS_DEVEPTIDR[12]) DataX Interrupt Clear */
#define UOTGHS_DEVEPTIDR_ERRORTRANSEC                    ( 0x1u << 10 )                           /**< \brief (UOTGHS_DEVEPTIDR[12]) Transaction Error Interrupt Clear */
/* -------- UOTGHS_DEVDMANXTDSC : (UOTGHS Offset: N/A) Device DMA Channel Next Descriptor Address Register -------- */
#define UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos              0
#define UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk              ( 0xffffffffu << UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos ) /**< \brief (UOTGHS_DEVDMANXTDSC) Next Descriptor Address */
#define UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD( value )    ( ( UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk & ( ( value ) << UOTGHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos ) ) )
/* -------- UOTGHS_DEVDMAADDRESS : (UOTGHS Offset: N/A) Device DMA Channel Address Register -------- */
#define UOTGHS_DEVDMAADDRESS_BUFF_ADD_Pos                0
#define UOTGHS_DEVDMAADDRESS_BUFF_ADD_Msk                ( 0xffffffffu << UOTGHS_DEVDMAADDRESS_BUFF_ADD_Pos ) /**< \brief (UOTGHS_DEVDMAADDRESS) Buffer Address */
#define UOTGHS_DEVDMAADDRESS_BUFF_ADD( value )    ( ( UOTGHS_DEVDMAADDRESS_BUFF_ADD_Msk & ( ( value ) << UOTGHS_DEVDMAADDRESS_BUFF_ADD_Pos ) ) )
/* -------- UOTGHS_DEVDMACONTROL : (UOTGHS Offset: N/A) Device DMA Channel Control Register -------- */
#define UOTGHS_DEVDMACONTROL_CHANN_ENB                   ( 0x1u << 0 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) Channel Enable Command */
#define UOTGHS_DEVDMACONTROL_LDNXT_DSC                   ( 0x1u << 1 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command */
#define UOTGHS_DEVDMACONTROL_END_TR_EN                   ( 0x1u << 2 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) End of Transfer Enable Control */
#define UOTGHS_DEVDMACONTROL_END_B_EN                    ( 0x1u << 3 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) End of Buffer Enable Control */
#define UOTGHS_DEVDMACONTROL_END_TR_IT                   ( 0x1u << 4 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) End of Transfer Interrupt Enable */
#define UOTGHS_DEVDMACONTROL_END_BUFFIT                  ( 0x1u << 5 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) End of Buffer Interrupt Enable */
#define UOTGHS_DEVDMACONTROL_DESC_LD_IT                  ( 0x1u << 6 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable */
#define UOTGHS_DEVDMACONTROL_BURST_LCK                   ( 0x1u << 7 )                                       /**< \brief (UOTGHS_DEVDMACONTROL) Burst Lock Enable */
#define UOTGHS_DEVDMACONTROL_BUFF_LENGTH_Pos             16
#define UOTGHS_DEVDMACONTROL_BUFF_LENGTH_Msk             ( 0xffffu << UOTGHS_DEVDMACONTROL_BUFF_LENGTH_Pos ) /**< \brief (UOTGHS_DEVDMACONTROL) Buffer Byte Length (Write-only) */
#define UOTGHS_DEVDMACONTROL_BUFF_LENGTH( value )    ( ( UOTGHS_DEVDMACONTROL_BUFF_LENGTH_Msk & ( ( value ) << UOTGHS_DEVDMACONTROL_BUFF_LENGTH_Pos ) ) )
/* -------- UOTGHS_DEVDMASTATUS : (UOTGHS Offset: N/A) Device DMA Channel Status Register -------- */
#define UOTGHS_DEVDMASTATUS_CHANN_ENB                    ( 0x1u << 0 )                                     /**< \brief (UOTGHS_DEVDMASTATUS) Channel Enable Status */
#define UOTGHS_DEVDMASTATUS_CHANN_ACT                    ( 0x1u << 1 )                                     /**< \brief (UOTGHS_DEVDMASTATUS) Channel Active Status */
#define UOTGHS_DEVDMASTATUS_END_TR_ST                    ( 0x1u << 4 )                                     /**< \brief (UOTGHS_DEVDMASTATUS) End of Channel Transfer Status */
#define UOTGHS_DEVDMASTATUS_END_BF_ST                    ( 0x1u << 5 )                                     /**< \brief (UOTGHS_DEVDMASTATUS) End of Channel Buffer Status */
#define UOTGHS_DEVDMASTATUS_DESC_LDST                    ( 0x1u << 6 )                                     /**< \brief (UOTGHS_DEVDMASTATUS) Descriptor Loaded Status */
#define UOTGHS_DEVDMASTATUS_BUFF_COUNT_Pos               16
#define UOTGHS_DEVDMASTATUS_BUFF_COUNT_Msk               ( 0xffffu << UOTGHS_DEVDMASTATUS_BUFF_COUNT_Pos ) /**< \brief (UOTGHS_DEVDMASTATUS) Buffer Byte Count */
#define UOTGHS_DEVDMASTATUS_BUFF_COUNT( value )    ( ( UOTGHS_DEVDMASTATUS_BUFF_COUNT_Msk & ( ( value ) << UOTGHS_DEVDMASTATUS_BUFF_COUNT_Pos ) ) )
/* -------- UOTGHS_HSTCTRL : (UOTGHS Offset: 0x0400) Host General Control Register -------- */
#define UOTGHS_HSTCTRL_SOFE                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTCTRL) Start of Frame Generation Enable */
#define UOTGHS_HSTCTRL_RESET                             ( 0x1u << 9 )                          /**< \brief (UOTGHS_HSTCTRL) Send USB Reset */
#define UOTGHS_HSTCTRL_RESUME                            ( 0x1u << 10 )                         /**< \brief (UOTGHS_HSTCTRL) Send USB Resume */
#define UOTGHS_HSTCTRL_SPDCONF_Pos                       12
#define UOTGHS_HSTCTRL_SPDCONF_Msk                       ( 0x3u << UOTGHS_HSTCTRL_SPDCONF_Pos ) /**< \brief (UOTGHS_HSTCTRL) Mode Configuration */
#define   UOTGHS_HSTCTRL_SPDCONF_NORMAL                  ( 0x0u << 12 )                         /**< \brief (UOTGHS_HSTCTRL) The host starts in full-speed mode and performs a high-speed reset to switch to the high-speed mode if the downstream peripheral is high-speed capable. */
#define   UOTGHS_HSTCTRL_SPDCONF_LOW_POWER               ( 0x1u << 12 )                         /**< \brief (UOTGHS_HSTCTRL) For a better consumption, if high-speed is not needed. */
#define   UOTGHS_HSTCTRL_SPDCONF_HIGH_SPEED              ( 0x2u << 12 )                         /**< \brief (UOTGHS_HSTCTRL) Forced high speed. */
#define   UOTGHS_HSTCTRL_SPDCONF_FORCED_FS               ( 0x3u << 12 )                         /**< \brief (UOTGHS_HSTCTRL) The host remains to full-speed mode whatever the peripheral speed capability. */
/* -------- UOTGHS_HSTISR : (UOTGHS Offset: 0x0404) Host Global Interrupt Status Register -------- */
#define UOTGHS_HSTISR_DCONNI                             ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTISR) Device Connection Interrupt */
#define UOTGHS_HSTISR_DDISCI                             ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTISR) Device Disconnection Interrupt */
#define UOTGHS_HSTISR_RSTI                               ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTISR) USB Reset Sent Interrupt */
#define UOTGHS_HSTISR_RSMEDI                             ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTISR) Downstream Resume Sent Interrupt */
#define UOTGHS_HSTISR_RXRSMI                             ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTISR) Upstream Resume Received Interrupt */
#define UOTGHS_HSTISR_HSOFI                              ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTISR) Host Start of Frame Interrupt */
#define UOTGHS_HSTISR_HWUPI                              ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTISR) Host Wake-Up Interrupt */
#define UOTGHS_HSTISR_PEP_0                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTISR) Pipe 0 Interrupt */
#define UOTGHS_HSTISR_PEP_1                              ( 0x1u << 9 )                          /**< \brief (UOTGHS_HSTISR) Pipe 1 Interrupt */
#define UOTGHS_HSTISR_PEP_2                              ( 0x1u << 10 )                         /**< \brief (UOTGHS_HSTISR) Pipe 2 Interrupt */
#define UOTGHS_HSTISR_PEP_3                              ( 0x1u << 11 )                         /**< \brief (UOTGHS_HSTISR) Pipe 3 Interrupt */
#define UOTGHS_HSTISR_PEP_4                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_HSTISR) Pipe 4 Interrupt */
#define UOTGHS_HSTISR_PEP_5                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_HSTISR) Pipe 5 Interrupt */
#define UOTGHS_HSTISR_PEP_6                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_HSTISR) Pipe 6 Interrupt */
#define UOTGHS_HSTISR_PEP_7                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_HSTISR) Pipe 7 Interrupt */
#define UOTGHS_HSTISR_PEP_8                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_HSTISR) Pipe 8 Interrupt */
#define UOTGHS_HSTISR_PEP_9                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_HSTISR) Pipe 9 Interrupt */
#define UOTGHS_HSTISR_PEP_10                             ( 0x1u << 18 )                         /**< \brief (UOTGHS_HSTISR) Pipe 10 Interrupt */
#define UOTGHS_HSTISR_PEP_11                             ( 0x1u << 19 )                         /**< \brief (UOTGHS_HSTISR) Pipe 11 Interrupt */
#define UOTGHS_HSTISR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 1 Interrupt */
#define UOTGHS_HSTISR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 2 Interrupt */
#define UOTGHS_HSTISR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 3 Interrupt */
#define UOTGHS_HSTISR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 4 Interrupt */
#define UOTGHS_HSTISR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 5 Interrupt */
