FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
#define UOTGHS_HSTISR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 6 Interrupt */
#define UOTGHS_HSTISR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_HSTISR) DMA Channel 7 Interrupt */
/* -------- UOTGHS_HSTICR : (UOTGHS Offset: 0x0408) Host Global Interrupt Clear Register -------- */
#define UOTGHS_HSTICR_DCONNIC                            ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTICR) Device Connection Interrupt Clear */
#define UOTGHS_HSTICR_DDISCIC                            ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTICR) Device Disconnection Interrupt Clear */
#define UOTGHS_HSTICR_RSTIC                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTICR) USB Reset Sent Interrupt Clear */
#define UOTGHS_HSTICR_RSMEDIC                            ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTICR) Downstream Resume Sent Interrupt Clear */
#define UOTGHS_HSTICR_RXRSMIC                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTICR) Upstream Resume Received Interrupt Clear */
#define UOTGHS_HSTICR_HSOFIC                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTICR) Host Start of Frame Interrupt Clear */
#define UOTGHS_HSTICR_HWUPIC                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTICR) Host Wake-Up Interrupt Clear */
/* -------- UOTGHS_HSTIFR : (UOTGHS Offset: 0x040C) Host Global Interrupt Set Register -------- */
#define UOTGHS_HSTIFR_DCONNIS                            ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTIFR) Device Connection Interrupt Set */
#define UOTGHS_HSTIFR_DDISCIS                            ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTIFR) Device Disconnection Interrupt Set */
#define UOTGHS_HSTIFR_RSTIS                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTIFR) USB Reset Sent Interrupt Set */
#define UOTGHS_HSTIFR_RSMEDIS                            ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTIFR) Downstream Resume Sent Interrupt Set */
#define UOTGHS_HSTIFR_RXRSMIS                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTIFR) Upstream Resume Received Interrupt Set */
#define UOTGHS_HSTIFR_HSOFIS                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTIFR) Host Start of Frame Interrupt Set */
#define UOTGHS_HSTIFR_HWUPIS                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTIFR) Host Wake-Up Interrupt Set */
#define UOTGHS_HSTIFR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 1 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 2 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 3 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 4 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 5 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 6 Interrupt Set */
#define UOTGHS_HSTIFR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_HSTIFR) DMA Channel 7 Interrupt Set */
/* -------- UOTGHS_HSTIMR : (UOTGHS Offset: 0x0410) Host Global Interrupt Mask Register -------- */
#define UOTGHS_HSTIMR_DCONNIE                            ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTIMR) Device Connection Interrupt Enable */
#define UOTGHS_HSTIMR_DDISCIE                            ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTIMR) Device Disconnection Interrupt Enable */
#define UOTGHS_HSTIMR_RSTIE                              ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTIMR) USB Reset Sent Interrupt Enable */
#define UOTGHS_HSTIMR_RSMEDIE                            ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTIMR) Downstream Resume Sent Interrupt Enable */
#define UOTGHS_HSTIMR_RXRSMIE                            ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTIMR) Upstream Resume Received Interrupt Enable */
#define UOTGHS_HSTIMR_HSOFIE                             ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTIMR) Host Start of Frame Interrupt Enable */
#define UOTGHS_HSTIMR_HWUPIE                             ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTIMR) Host Wake-Up Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_0                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTIMR) Pipe 0 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_1                              ( 0x1u << 9 )                          /**< \brief (UOTGHS_HSTIMR) Pipe 1 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_2                              ( 0x1u << 10 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 2 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_3                              ( 0x1u << 11 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 3 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_4                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 4 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_5                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 5 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_6                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 6 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_7                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 7 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_8                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 8 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_9                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 9 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_10                             ( 0x1u << 18 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 10 Interrupt Enable */
#define UOTGHS_HSTIMR_PEP_11                             ( 0x1u << 19 )                         /**< \brief (UOTGHS_HSTIMR) Pipe 11 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 1 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 2 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 3 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 4 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 5 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 6 Interrupt Enable */
#define UOTGHS_HSTIMR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_HSTIMR) DMA Channel 7 Interrupt Enable */
/* -------- UOTGHS_HSTIDR : (UOTGHS Offset: 0x0414) Host Global Interrupt Disable Register -------- */
#define UOTGHS_HSTIDR_DCONNIEC                           ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTIDR) Device Connection Interrupt Disable */
#define UOTGHS_HSTIDR_DDISCIEC                           ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTIDR) Device Disconnection Interrupt Disable */
#define UOTGHS_HSTIDR_RSTIEC                             ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTIDR) USB Reset Sent Interrupt Disable */
#define UOTGHS_HSTIDR_RSMEDIEC                           ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTIDR) Downstream Resume Sent Interrupt Disable */
#define UOTGHS_HSTIDR_RXRSMIEC                           ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTIDR) Upstream Resume Received Interrupt Disable */
#define UOTGHS_HSTIDR_HSOFIEC                            ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTIDR) Host Start of Frame Interrupt Disable */
#define UOTGHS_HSTIDR_HWUPIEC                            ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTIDR) Host Wake-Up Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_0                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTIDR) Pipe 0 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_1                              ( 0x1u << 9 )                          /**< \brief (UOTGHS_HSTIDR) Pipe 1 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_2                              ( 0x1u << 10 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 2 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_3                              ( 0x1u << 11 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 3 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_4                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 4 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_5                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 5 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_6                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 6 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_7                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 7 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_8                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 8 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_9                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 9 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_10                             ( 0x1u << 18 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 10 Interrupt Disable */
#define UOTGHS_HSTIDR_PEP_11                             ( 0x1u << 19 )                         /**< \brief (UOTGHS_HSTIDR) Pipe 11 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 1 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 2 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 3 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 4 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 5 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 6 Interrupt Disable */
#define UOTGHS_HSTIDR_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_HSTIDR) DMA Channel 7 Interrupt Disable */
/* -------- UOTGHS_HSTIER : (UOTGHS Offset: 0x0418) Host Global Interrupt Enable Register -------- */
#define UOTGHS_HSTIER_DCONNIES                           ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTIER) Device Connection Interrupt Enable */
#define UOTGHS_HSTIER_DDISCIES                           ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTIER) Device Disconnection Interrupt Enable */
#define UOTGHS_HSTIER_RSTIES                             ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTIER) USB Reset Sent Interrupt Enable */
#define UOTGHS_HSTIER_RSMEDIES                           ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTIER) Downstream Resume Sent Interrupt Enable */
#define UOTGHS_HSTIER_RXRSMIES                           ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTIER) Upstream Resume Received Interrupt Enable */
#define UOTGHS_HSTIER_HSOFIES                            ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTIER) Host Start of Frame Interrupt Enable */
#define UOTGHS_HSTIER_HWUPIES                            ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTIER) Host Wake-Up Interrupt Enable */
#define UOTGHS_HSTIER_PEP_0                              ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTIER) Pipe 0 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_1                              ( 0x1u << 9 )                          /**< \brief (UOTGHS_HSTIER) Pipe 1 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_2                              ( 0x1u << 10 )                         /**< \brief (UOTGHS_HSTIER) Pipe 2 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_3                              ( 0x1u << 11 )                         /**< \brief (UOTGHS_HSTIER) Pipe 3 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_4                              ( 0x1u << 12 )                         /**< \brief (UOTGHS_HSTIER) Pipe 4 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_5                              ( 0x1u << 13 )                         /**< \brief (UOTGHS_HSTIER) Pipe 5 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_6                              ( 0x1u << 14 )                         /**< \brief (UOTGHS_HSTIER) Pipe 6 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_7                              ( 0x1u << 15 )                         /**< \brief (UOTGHS_HSTIER) Pipe 7 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_8                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_HSTIER) Pipe 8 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_9                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_HSTIER) Pipe 9 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_10                             ( 0x1u << 18 )                         /**< \brief (UOTGHS_HSTIER) Pipe 10 Interrupt Enable */
#define UOTGHS_HSTIER_PEP_11                             ( 0x1u << 19 )                         /**< \brief (UOTGHS_HSTIER) Pipe 11 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_1                              ( 0x1u << 25 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 1 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_2                              ( 0x1u << 26 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 2 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_3                              ( 0x1u << 27 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 3 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_4                              ( 0x1u << 28 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 4 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_5                              ( 0x1u << 29 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 5 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_6                              ( 0x1u << 30 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 6 Interrupt Enable */
#define UOTGHS_HSTIER_DMA_7                              ( 0x1u << 31 )                         /**< \brief (UOTGHS_HSTIER) DMA Channel 7 Interrupt Enable */
/* -------- UOTGHS_HSTPIP : (UOTGHS Offset: 0x0041C) Host Pipe Register -------- */
#define UOTGHS_HSTPIP_PEN0                               ( 0x1u << 0 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 0 Enable */
#define UOTGHS_HSTPIP_PEN1                               ( 0x1u << 1 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 1 Enable */
#define UOTGHS_HSTPIP_PEN2                               ( 0x1u << 2 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 2 Enable */
#define UOTGHS_HSTPIP_PEN3                               ( 0x1u << 3 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 3 Enable */
#define UOTGHS_HSTPIP_PEN4                               ( 0x1u << 4 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 4 Enable */
#define UOTGHS_HSTPIP_PEN5                               ( 0x1u << 5 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 5 Enable */
#define UOTGHS_HSTPIP_PEN6                               ( 0x1u << 6 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 6 Enable */
#define UOTGHS_HSTPIP_PEN7                               ( 0x1u << 7 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 7 Enable */
#define UOTGHS_HSTPIP_PEN8                               ( 0x1u << 8 )                          /**< \brief (UOTGHS_HSTPIP) Pipe 8 Enable */
#define UOTGHS_HSTPIP_PRST0                              ( 0x1u << 16 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 0 Reset */
#define UOTGHS_HSTPIP_PRST1                              ( 0x1u << 17 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 1 Reset */
#define UOTGHS_HSTPIP_PRST2                              ( 0x1u << 18 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 2 Reset */
#define UOTGHS_HSTPIP_PRST3                              ( 0x1u << 19 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 3 Reset */
#define UOTGHS_HSTPIP_PRST4                              ( 0x1u << 20 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 4 Reset */
#define UOTGHS_HSTPIP_PRST5                              ( 0x1u << 21 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 5 Reset */
#define UOTGHS_HSTPIP_PRST6                              ( 0x1u << 22 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 6 Reset */
#define UOTGHS_HSTPIP_PRST7                              ( 0x1u << 23 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 7 Reset */
#define UOTGHS_HSTPIP_PRST8                              ( 0x1u << 24 )                         /**< \brief (UOTGHS_HSTPIP) Pipe 8 Reset */
/* -------- UOTGHS_HSTFNUM : (UOTGHS Offset: 0x0420) Host Frame Number Register -------- */
#define UOTGHS_HSTFNUM_MFNUM_Pos                         0
#define UOTGHS_HSTFNUM_MFNUM_Msk                         ( 0x7u << UOTGHS_HSTFNUM_MFNUM_Pos ) /**< \brief (UOTGHS_HSTFNUM) Micro Frame Number */
#define UOTGHS_HSTFNUM_MFNUM( value )       ( ( UOTGHS_HSTFNUM_MFNUM_Msk & ( ( value ) << UOTGHS_HSTFNUM_MFNUM_Pos ) ) )
#define UOTGHS_HSTFNUM_FNUM_Pos                          3
#define UOTGHS_HSTFNUM_FNUM_Msk                          ( 0x7ffu << UOTGHS_HSTFNUM_FNUM_Pos ) /**< \brief (UOTGHS_HSTFNUM) Frame Number */
#define UOTGHS_HSTFNUM_FNUM( value )        ( ( UOTGHS_HSTFNUM_FNUM_Msk & ( ( value ) << UOTGHS_HSTFNUM_FNUM_Pos ) ) )
#define UOTGHS_HSTFNUM_FLENHIGH_Pos                      16
#define UOTGHS_HSTFNUM_FLENHIGH_Msk                      ( 0xffu << UOTGHS_HSTFNUM_FLENHIGH_Pos ) /**< \brief (UOTGHS_HSTFNUM) Frame Length */
#define UOTGHS_HSTFNUM_FLENHIGH( value )    ( ( UOTGHS_HSTFNUM_FLENHIGH_Msk & ( ( value ) << UOTGHS_HSTFNUM_FLENHIGH_Pos ) ) )
/* -------- UOTGHS_HSTADDR1 : (UOTGHS Offset: 0x0424) Host Address 1 Register -------- */
#define UOTGHS_HSTADDR1_HSTADDRP0_Pos                    0
#define UOTGHS_HSTADDR1_HSTADDRP0_Msk                    ( 0x7fu << UOTGHS_HSTADDR1_HSTADDRP0_Pos ) /**< \brief (UOTGHS_HSTADDR1) USB Host Address */
#define UOTGHS_HSTADDR1_HSTADDRP0( value )    ( ( UOTGHS_HSTADDR1_HSTADDRP0_Msk & ( ( value ) << UOTGHS_HSTADDR1_HSTADDRP0_Pos ) ) )
#define UOTGHS_HSTADDR1_HSTADDRP1_Pos                    8
#define UOTGHS_HSTADDR1_HSTADDRP1_Msk                    ( 0x7fu << UOTGHS_HSTADDR1_HSTADDRP1_Pos ) /**< \brief (UOTGHS_HSTADDR1) USB Host Address */
#define UOTGHS_HSTADDR1_HSTADDRP1( value )    ( ( UOTGHS_HSTADDR1_HSTADDRP1_Msk & ( ( value ) << UOTGHS_HSTADDR1_HSTADDRP1_Pos ) ) )
#define UOTGHS_HSTADDR1_HSTADDRP2_Pos                    16
#define UOTGHS_HSTADDR1_HSTADDRP2_Msk                    ( 0x7fu << UOTGHS_HSTADDR1_HSTADDRP2_Pos ) /**< \brief (UOTGHS_HSTADDR1) USB Host Address */
#define UOTGHS_HSTADDR1_HSTADDRP2( value )    ( ( UOTGHS_HSTADDR1_HSTADDRP2_Msk & ( ( value ) << UOTGHS_HSTADDR1_HSTADDRP2_Pos ) ) )
#define UOTGHS_HSTADDR1_HSTADDRP3_Pos                    24
#define UOTGHS_HSTADDR1_HSTADDRP3_Msk                    ( 0x7fu << UOTGHS_HSTADDR1_HSTADDRP3_Pos ) /**< \brief (UOTGHS_HSTADDR1) USB Host Address */
#define UOTGHS_HSTADDR1_HSTADDRP3( value )    ( ( UOTGHS_HSTADDR1_HSTADDRP3_Msk & ( ( value ) << UOTGHS_HSTADDR1_HSTADDRP3_Pos ) ) )
/* -------- UOTGHS_HSTADDR2 : (UOTGHS Offset: 0x0428) Host Address 2 Register -------- */
#define UOTGHS_HSTADDR2_HSTADDRP4_Pos                    0
#define UOTGHS_HSTADDR2_HSTADDRP4_Msk                    ( 0x7fu << UOTGHS_HSTADDR2_HSTADDRP4_Pos ) /**< \brief (UOTGHS_HSTADDR2) USB Host Address */
#define UOTGHS_HSTADDR2_HSTADDRP4( value )    ( ( UOTGHS_HSTADDR2_HSTADDRP4_Msk & ( ( value ) << UOTGHS_HSTADDR2_HSTADDRP4_Pos ) ) )
#define UOTGHS_HSTADDR2_HSTADDRP5_Pos                    8
#define UOTGHS_HSTADDR2_HSTADDRP5_Msk                    ( 0x7fu << UOTGHS_HSTADDR2_HSTADDRP5_Pos ) /**< \brief (UOTGHS_HSTADDR2) USB Host Address */
#define UOTGHS_HSTADDR2_HSTADDRP5( value )    ( ( UOTGHS_HSTADDR2_HSTADDRP5_Msk & ( ( value ) << UOTGHS_HSTADDR2_HSTADDRP5_Pos ) ) )
#define UOTGHS_HSTADDR2_HSTADDRP6_Pos                    16
#define UOTGHS_HSTADDR2_HSTADDRP6_Msk                    ( 0x7fu << UOTGHS_HSTADDR2_HSTADDRP6_Pos ) /**< \brief (UOTGHS_HSTADDR2) USB Host Address */
#define UOTGHS_HSTADDR2_HSTADDRP6( value )    ( ( UOTGHS_HSTADDR2_HSTADDRP6_Msk & ( ( value ) << UOTGHS_HSTADDR2_HSTADDRP6_Pos ) ) )
#define UOTGHS_HSTADDR2_HSTADDRP7_Pos                    24
#define UOTGHS_HSTADDR2_HSTADDRP7_Msk                    ( 0x7fu << UOTGHS_HSTADDR2_HSTADDRP7_Pos ) /**< \brief (UOTGHS_HSTADDR2) USB Host Address */
#define UOTGHS_HSTADDR2_HSTADDRP7( value )    ( ( UOTGHS_HSTADDR2_HSTADDRP7_Msk & ( ( value ) << UOTGHS_HSTADDR2_HSTADDRP7_Pos ) ) )
/* -------- UOTGHS_HSTADDR3 : (UOTGHS Offset: 0x042C) Host Address 3 Register -------- */
#define UOTGHS_HSTADDR3_HSTADDRP8_Pos                    0
#define UOTGHS_HSTADDR3_HSTADDRP8_Msk                    ( 0x7fu << UOTGHS_HSTADDR3_HSTADDRP8_Pos ) /**< \brief (UOTGHS_HSTADDR3) USB Host Address */
#define UOTGHS_HSTADDR3_HSTADDRP8( value )    ( ( UOTGHS_HSTADDR3_HSTADDRP8_Msk & ( ( value ) << UOTGHS_HSTADDR3_HSTADDRP8_Pos ) ) )
#define UOTGHS_HSTADDR3_HSTADDRP9_Pos                    8
#define UOTGHS_HSTADDR3_HSTADDRP9_Msk                    ( 0x7fu << UOTGHS_HSTADDR3_HSTADDRP9_Pos ) /**< \brief (UOTGHS_HSTADDR3) USB Host Address */
#define UOTGHS_HSTADDR3_HSTADDRP9( value )    ( ( UOTGHS_HSTADDR3_HSTADDRP9_Msk & ( ( value ) << UOTGHS_HSTADDR3_HSTADDRP9_Pos ) ) )
/* -------- UOTGHS_HSTPIPCFG[12] : (UOTGHS Offset: 0x500) Host Pipe Configuration Register (n = 0) -------- */
