FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
#define UOTGHS_HSTPIPCFG_ALLOC                           ( 0x1u << 1 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Memory Allocate */
#define UOTGHS_HSTPIPCFG_PBK_Pos                         2
#define UOTGHS_HSTPIPCFG_PBK_Msk                         ( 0x3u << UOTGHS_HSTPIPCFG_PBK_Pos )    /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Banks */
#define   UOTGHS_HSTPIPCFG_PBK_1_BANK                    ( 0x0u << 2 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) Single-bank pipe */
#define   UOTGHS_HSTPIPCFG_PBK_2_BANK                    ( 0x1u << 2 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) Double-bank pipe */
#define   UOTGHS_HSTPIPCFG_PBK_3_BANK                    ( 0x2u << 2 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) Triple-bank pipe */
#define UOTGHS_HSTPIPCFG_PSIZE_Pos                       4
#define UOTGHS_HSTPIPCFG_PSIZE_Msk                       ( 0x7u << UOTGHS_HSTPIPCFG_PSIZE_Pos )  /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Size */
#define   UOTGHS_HSTPIPCFG_PSIZE_8_BYTE                  ( 0x0u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 8 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_16_BYTE                 ( 0x1u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 16 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_32_BYTE                 ( 0x2u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 32 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_64_BYTE                 ( 0x3u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 64 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_128_BYTE                ( 0x4u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 128 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_256_BYTE                ( 0x5u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 256 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_512_BYTE                ( 0x6u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 512 bytes */
#define   UOTGHS_HSTPIPCFG_PSIZE_1024_BYTE               ( 0x7u << 4 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) 1024 bytes */
#define UOTGHS_HSTPIPCFG_PTOKEN_Pos                      8
#define UOTGHS_HSTPIPCFG_PTOKEN_Msk                      ( 0x3u << UOTGHS_HSTPIPCFG_PTOKEN_Pos ) /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Token */
#define   UOTGHS_HSTPIPCFG_PTOKEN_SETUP                  ( 0x0u << 8 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) SETUP */
#define   UOTGHS_HSTPIPCFG_PTOKEN_IN                     ( 0x1u << 8 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) IN */
#define   UOTGHS_HSTPIPCFG_PTOKEN_OUT                    ( 0x2u << 8 )                           /**< \brief (UOTGHS_HSTPIPCFG[12]) OUT */
#define UOTGHS_HSTPIPCFG_AUTOSW                          ( 0x1u << 10 )                          /**< \brief (UOTGHS_HSTPIPCFG[12]) Automatic Switch */
#define UOTGHS_HSTPIPCFG_PTYPE_Pos                       12
#define UOTGHS_HSTPIPCFG_PTYPE_Msk                       ( 0x3u << UOTGHS_HSTPIPCFG_PTYPE_Pos )  /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Type */
#define   UOTGHS_HSTPIPCFG_PTYPE_CTRL                    ( 0x0u << 12 )                          /**< \brief (UOTGHS_HSTPIPCFG[12]) Control */
#define   UOTGHS_HSTPIPCFG_PTYPE_ISO                     ( 0x1u << 12 )                          /**< \brief (UOTGHS_HSTPIPCFG[12]) Isochronous */
#define   UOTGHS_HSTPIPCFG_PTYPE_BLK                     ( 0x2u << 12 )                          /**< \brief (UOTGHS_HSTPIPCFG[12]) Bulk */
#define   UOTGHS_HSTPIPCFG_PTYPE_INTRPT                  ( 0x3u << 12 )                          /**< \brief (UOTGHS_HSTPIPCFG[12]) Interrupt */
#define UOTGHS_HSTPIPCFG_PEPNUM_Pos                      16
#define UOTGHS_HSTPIPCFG_PEPNUM_Msk                      ( 0xfu << UOTGHS_HSTPIPCFG_PEPNUM_Pos ) /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Endpoint Number */
#define UOTGHS_HSTPIPCFG_PEPNUM( value )    ( ( UOTGHS_HSTPIPCFG_PEPNUM_Msk & ( ( value ) << UOTGHS_HSTPIPCFG_PEPNUM_Pos ) ) )
#define UOTGHS_HSTPIPCFG_INTFRQ_Pos                      24
#define UOTGHS_HSTPIPCFG_INTFRQ_Msk                      ( 0xffu << UOTGHS_HSTPIPCFG_INTFRQ_Pos )    /**< \brief (UOTGHS_HSTPIPCFG[12]) Pipe Interrupt Request Frequency */
#define UOTGHS_HSTPIPCFG_INTFRQ( value )    ( ( UOTGHS_HSTPIPCFG_INTFRQ_Msk & ( ( value ) << UOTGHS_HSTPIPCFG_INTFRQ_Pos ) ) )
#define UOTGHS_HSTPIPCFG_PINGEN                          ( 0x1u << 20 )                              /**< \brief (UOTGHS_HSTPIPCFG[12]) Ping Enable */
#define UOTGHS_HSTPIPCFG_BINTERVAL_Pos                   24
#define UOTGHS_HSTPIPCFG_BINTERVAL_Msk                   ( 0xffu << UOTGHS_HSTPIPCFG_BINTERVAL_Pos ) /**< \brief (UOTGHS_HSTPIPCFG[12]) Binterval Parameter for the Bulk-Out/Ping Transaction */
#define UOTGHS_HSTPIPCFG_BINTERVAL( value )    ( ( UOTGHS_HSTPIPCFG_BINTERVAL_Msk & ( ( value ) << UOTGHS_HSTPIPCFG_BINTERVAL_Pos ) ) )
/* -------- UOTGHS_HSTPIPISR[12] : (UOTGHS Offset: 0x530) Host Pipe Status Register (n = 0) -------- */
#define UOTGHS_HSTPIPISR_RXINI                           ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Received IN Data Interrupt */
#define UOTGHS_HSTPIPISR_TXOUTI                          ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Transmitted OUT Data Interrupt */
#define UOTGHS_HSTPIPISR_TXSTPI                          ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Transmitted SETUP Interrupt */
#define UOTGHS_HSTPIPISR_PERRI                           ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Pipe Error Interrupt */
#define UOTGHS_HSTPIPISR_NAKEDI                          ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) NAKed Interrupt */
#define UOTGHS_HSTPIPISR_OVERFI                          ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Overflow Interrupt */
#define UOTGHS_HSTPIPISR_RXSTALLDI                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Received STALLed Interrupt */
#define UOTGHS_HSTPIPISR_SHORTPACKETI                    ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Short Packet Interrupt */
#define UOTGHS_HSTPIPISR_DTSEQ_Pos                       8
#define UOTGHS_HSTPIPISR_DTSEQ_Msk                       ( 0x3u << UOTGHS_HSTPIPISR_DTSEQ_Pos )   /**< \brief (UOTGHS_HSTPIPISR[12]) Data Toggle Sequence */
#define   UOTGHS_HSTPIPISR_DTSEQ_DATA0                   ( 0x0u << 8 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Data0 toggle sequence */
#define   UOTGHS_HSTPIPISR_DTSEQ_DATA1                   ( 0x1u << 8 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Data1 toggle sequence */
#define UOTGHS_HSTPIPISR_NBUSYBK_Pos                     12
#define UOTGHS_HSTPIPISR_NBUSYBK_Msk                     ( 0x3u << UOTGHS_HSTPIPISR_NBUSYBK_Pos ) /**< \brief (UOTGHS_HSTPIPISR[12]) Number of Busy Banks */
#define   UOTGHS_HSTPIPISR_NBUSYBK_0_BUSY                ( 0x0u << 12 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) 0 busy bank (all banks free) */
#define   UOTGHS_HSTPIPISR_NBUSYBK_1_BUSY                ( 0x1u << 12 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) 1 busy bank */
#define   UOTGHS_HSTPIPISR_NBUSYBK_2_BUSY                ( 0x2u << 12 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) 2 busy banks */
#define   UOTGHS_HSTPIPISR_NBUSYBK_3_BUSY                ( 0x3u << 12 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) 3 busy banks */
#define UOTGHS_HSTPIPISR_CURRBK_Pos                      14
#define UOTGHS_HSTPIPISR_CURRBK_Msk                      ( 0x3u << UOTGHS_HSTPIPISR_CURRBK_Pos )  /**< \brief (UOTGHS_HSTPIPISR[12]) Current Bank */
#define   UOTGHS_HSTPIPISR_CURRBK_BANK0                  ( 0x0u << 14 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) Current bank is bank0 */
#define   UOTGHS_HSTPIPISR_CURRBK_BANK1                  ( 0x1u << 14 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) Current bank is bank1 */
#define   UOTGHS_HSTPIPISR_CURRBK_BANK2                  ( 0x2u << 14 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) Current bank is bank2 */
#define UOTGHS_HSTPIPISR_RWALL                           ( 0x1u << 16 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) Read-write Allowed */
#define UOTGHS_HSTPIPISR_CFGOK                           ( 0x1u << 18 )                           /**< \brief (UOTGHS_HSTPIPISR[12]) Configuration OK Status */
#define UOTGHS_HSTPIPISR_PBYCT_Pos                       20
#define UOTGHS_HSTPIPISR_PBYCT_Msk                       ( 0x7ffu << UOTGHS_HSTPIPISR_PBYCT_Pos ) /**< \brief (UOTGHS_HSTPIPISR[12]) Pipe Byte Count */
#define UOTGHS_HSTPIPISR_UNDERFI                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) Underflow Interrupt */
#define UOTGHS_HSTPIPISR_CRCERRI                         ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPISR[12]) CRC Error Interrupt */
/* -------- UOTGHS_HSTPIPICR[12] : (UOTGHS Offset: 0x560) Host Pipe Clear Register (n = 0) -------- */
#define UOTGHS_HSTPIPICR_RXINIC                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Received IN Data Interrupt Clear */
#define UOTGHS_HSTPIPICR_TXOUTIC                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Transmitted OUT Data Interrupt Clear */
#define UOTGHS_HSTPIPICR_TXSTPIC                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Transmitted SETUP Interrupt Clear */
#define UOTGHS_HSTPIPICR_NAKEDIC                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) NAKed Interrupt Clear */
#define UOTGHS_HSTPIPICR_OVERFIC                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Overflow Interrupt Clear */
#define UOTGHS_HSTPIPICR_RXSTALLDIC                      ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Received STALLed Interrupt Clear */
#define UOTGHS_HSTPIPICR_SHORTPACKETIC                   ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Short Packet Interrupt Clear */
#define UOTGHS_HSTPIPICR_UNDERFIC                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) Underflow Interrupt Clear */
#define UOTGHS_HSTPIPICR_CRCERRIC                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPICR[12]) CRC Error Interrupt Clear */
/* -------- UOTGHS_HSTPIPIFR[12] : (UOTGHS Offset: 0x590) Host Pipe Set Register (n = 0) -------- */
#define UOTGHS_HSTPIPIFR_RXINIS                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Received IN Data Interrupt Set */
#define UOTGHS_HSTPIPIFR_TXOUTIS                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Transmitted OUT Data Interrupt Set */
#define UOTGHS_HSTPIPIFR_TXSTPIS                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Transmitted SETUP Interrupt Set */
#define UOTGHS_HSTPIPIFR_PERRIS                          ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Pipe Error Interrupt Set */
#define UOTGHS_HSTPIPIFR_NAKEDIS                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) NAKed Interrupt Set */
#define UOTGHS_HSTPIPIFR_OVERFIS                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Overflow Interrupt Set */
#define UOTGHS_HSTPIPIFR_RXSTALLDIS                      ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Received STALLed Interrupt Set */
#define UOTGHS_HSTPIPIFR_SHORTPACKETIS                   ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Short Packet Interrupt Set */
#define UOTGHS_HSTPIPIFR_NBUSYBKS                        ( 0x1u << 12 )                           /**< \brief (UOTGHS_HSTPIPIFR[12]) Number of Busy Banks Set */
#define UOTGHS_HSTPIPIFR_UNDERFIS                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) Underflow Interrupt Set */
#define UOTGHS_HSTPIPIFR_CRCERRIS                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIFR[12]) CRC Error Interrupt Set */
/* -------- UOTGHS_HSTPIPIMR[12] : (UOTGHS Offset: 0x5C0) Host Pipe Mask Register (n = 0) -------- */
#define UOTGHS_HSTPIPIMR_RXINE                           ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Received IN Data Interrupt Enable */
#define UOTGHS_HSTPIPIMR_TXOUTE                          ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Transmitted OUT Data Interrupt Enable */
#define UOTGHS_HSTPIPIMR_TXSTPE                          ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Transmitted SETUP Interrupt Enable */
#define UOTGHS_HSTPIPIMR_PERRE                           ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Pipe Error Interrupt Enable */
#define UOTGHS_HSTPIPIMR_NAKEDE                          ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) NAKed Interrupt Enable */
#define UOTGHS_HSTPIPIMR_OVERFIE                         ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Overflow Interrupt Enable */
#define UOTGHS_HSTPIPIMR_RXSTALLDE                       ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Received STALLed Interrupt Enable */
#define UOTGHS_HSTPIPIMR_SHORTPACKETIE                   ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Short Packet Interrupt Enable */
#define UOTGHS_HSTPIPIMR_NBUSYBKE                        ( 0x1u << 12 )                           /**< \brief (UOTGHS_HSTPIPIMR[12]) Number of Busy Banks Interrupt Enable */
#define UOTGHS_HSTPIPIMR_FIFOCON                         ( 0x1u << 14 )                           /**< \brief (UOTGHS_HSTPIPIMR[12]) FIFO Control */
#define UOTGHS_HSTPIPIMR_PDISHDMA                        ( 0x1u << 16 )                           /**< \brief (UOTGHS_HSTPIPIMR[12]) Pipe Interrupts Disable HDMA Request Enable */
#define UOTGHS_HSTPIPIMR_PFREEZE                         ( 0x1u << 17 )                           /**< \brief (UOTGHS_HSTPIPIMR[12]) Pipe Freeze */
#define UOTGHS_HSTPIPIMR_RSTDT                           ( 0x1u << 18 )                           /**< \brief (UOTGHS_HSTPIPIMR[12]) Reset Data Toggle */
#define UOTGHS_HSTPIPIMR_UNDERFIE                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) Underflow Interrupt Enable */
#define UOTGHS_HSTPIPIMR_CRCERRE                         ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIMR[12]) CRC Error Interrupt Enable */
/* -------- UOTGHS_HSTPIPIER[12] : (UOTGHS Offset: 0x5F0) Host Pipe Enable Register (n = 0) -------- */
#define UOTGHS_HSTPIPIER_RXINES                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Received IN Data Interrupt Enable */
#define UOTGHS_HSTPIPIER_TXOUTES                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Transmitted OUT Data Interrupt Enable */
#define UOTGHS_HSTPIPIER_TXSTPES                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Transmitted SETUP Interrupt Enable */
#define UOTGHS_HSTPIPIER_PERRES                          ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Pipe Error Interrupt Enable */
#define UOTGHS_HSTPIPIER_NAKEDES                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) NAKed Interrupt Enable */
#define UOTGHS_HSTPIPIER_OVERFIES                        ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Overflow Interrupt Enable */
#define UOTGHS_HSTPIPIER_RXSTALLDES                      ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Received STALLed Interrupt Enable */
#define UOTGHS_HSTPIPIER_SHORTPACKETIES                  ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Short Packet Interrupt Enable */
#define UOTGHS_HSTPIPIER_NBUSYBKES                       ( 0x1u << 12 )                           /**< \brief (UOTGHS_HSTPIPIER[12]) Number of Busy Banks Enable */
#define UOTGHS_HSTPIPIER_PDISHDMAS                       ( 0x1u << 16 )                           /**< \brief (UOTGHS_HSTPIPIER[12]) Pipe Interrupts Disable HDMA Request Enable */
#define UOTGHS_HSTPIPIER_PFREEZES                        ( 0x1u << 17 )                           /**< \brief (UOTGHS_HSTPIPIER[12]) Pipe Freeze Enable */
#define UOTGHS_HSTPIPIER_RSTDTS                          ( 0x1u << 18 )                           /**< \brief (UOTGHS_HSTPIPIER[12]) Reset Data Toggle Enable */
#define UOTGHS_HSTPIPIER_UNDERFIES                       ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) Underflow Interrupt Enable */
#define UOTGHS_HSTPIPIER_CRCERRES                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIER[12]) CRC Error Interrupt Enable */
/* -------- UOTGHS_HSTPIPIDR[12] : (UOTGHS Offset: 0x620) Host Pipe Disable Register (n = 0) -------- */
#define UOTGHS_HSTPIPIDR_RXINEC                          ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Received IN Data Interrupt Disable */
#define UOTGHS_HSTPIPIDR_TXOUTEC                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Transmitted OUT Data Interrupt Disable */
#define UOTGHS_HSTPIPIDR_TXSTPEC                         ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Transmitted SETUP Interrupt Disable */
#define UOTGHS_HSTPIPIDR_PERREC                          ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Pipe Error Interrupt Disable */
#define UOTGHS_HSTPIPIDR_NAKEDEC                         ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) NAKed Interrupt Disable */
#define UOTGHS_HSTPIPIDR_OVERFIEC                        ( 0x1u << 5 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Overflow Interrupt Disable */
#define UOTGHS_HSTPIPIDR_RXSTALLDEC                      ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Received STALLed Interrupt Disable */
#define UOTGHS_HSTPIPIDR_SHORTPACKETIEC                  ( 0x1u << 7 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Short Packet Interrupt Disable */
#define UOTGHS_HSTPIPIDR_NBUSYBKEC                       ( 0x1u << 12 )                           /**< \brief (UOTGHS_HSTPIPIDR[12]) Number of Busy Banks Disable */
#define UOTGHS_HSTPIPIDR_FIFOCONC                        ( 0x1u << 14 )                           /**< \brief (UOTGHS_HSTPIPIDR[12]) FIFO Control Disable */
#define UOTGHS_HSTPIPIDR_PDISHDMAC                       ( 0x1u << 16 )                           /**< \brief (UOTGHS_HSTPIPIDR[12]) Pipe Interrupts Disable HDMA Request Disable */
#define UOTGHS_HSTPIPIDR_PFREEZEC                        ( 0x1u << 17 )                           /**< \brief (UOTGHS_HSTPIPIDR[12]) Pipe Freeze Disable */
#define UOTGHS_HSTPIPIDR_UNDERFIEC                       ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) Underflow Interrupt Disable */
#define UOTGHS_HSTPIPIDR_CRCERREC                        ( 0x1u << 6 )                            /**< \brief (UOTGHS_HSTPIPIDR[12]) CRC Error Interrupt Disable */
/* -------- UOTGHS_HSTPIPINRQ[12] : (UOTGHS Offset: 0x650) Host Pipe IN Request Register (n = 0) -------- */
#define UOTGHS_HSTPIPINRQ_INRQ_Pos                       0
#define UOTGHS_HSTPIPINRQ_INRQ_Msk                       ( 0xffu << UOTGHS_HSTPIPINRQ_INRQ_Pos )  /**< \brief (UOTGHS_HSTPIPINRQ[12]) IN Request Number before Freeze */
#define UOTGHS_HSTPIPINRQ_INRQ( value )    ( ( UOTGHS_HSTPIPINRQ_INRQ_Msk & ( ( value ) << UOTGHS_HSTPIPINRQ_INRQ_Pos ) ) )
#define UOTGHS_HSTPIPINRQ_INMODE                         ( 0x1u << 8 )                            /**< \brief (UOTGHS_HSTPIPINRQ[12]) IN Request Mode */
/* -------- UOTGHS_HSTPIPERR[12] : (UOTGHS Offset: 0x680) Host Pipe Error Register (n = 0) -------- */
#define UOTGHS_HSTPIPERR_DATATGL                         ( 0x1u << 0 )                            /**< \brief (UOTGHS_HSTPIPERR[12]) Data Toggle Error */
#define UOTGHS_HSTPIPERR_DATAPID                         ( 0x1u << 1 )                            /**< \brief (UOTGHS_HSTPIPERR[12]) Data PID Error */
#define UOTGHS_HSTPIPERR_PID                             ( 0x1u << 2 )                            /**< \brief (UOTGHS_HSTPIPERR[12]) PID Error */
#define UOTGHS_HSTPIPERR_TIMEOUT                         ( 0x1u << 3 )                            /**< \brief (UOTGHS_HSTPIPERR[12]) Time-Out Error */
#define UOTGHS_HSTPIPERR_CRC16                           ( 0x1u << 4 )                            /**< \brief (UOTGHS_HSTPIPERR[12]) CRC16 Error */
#define UOTGHS_HSTPIPERR_COUNTER_Pos                     5
#define UOTGHS_HSTPIPERR_COUNTER_Msk                     ( 0x3u << UOTGHS_HSTPIPERR_COUNTER_Pos ) /**< \brief (UOTGHS_HSTPIPERR[12]) Error Counter */
#define UOTGHS_HSTPIPERR_COUNTER( value )    ( ( UOTGHS_HSTPIPERR_COUNTER_Msk & ( ( value ) << UOTGHS_HSTPIPERR_COUNTER_Pos ) ) )
/* -------- UOTGHS_HSTDMANXTDSC : (UOTGHS Offset: N/A) Host DMA Channel Next Descriptor Address Register -------- */
#define UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos              0
#define UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk              ( 0xffffffffu << UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos ) /**< \brief (UOTGHS_HSTDMANXTDSC) Next Descriptor Address */
#define UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD( value )    ( ( UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk & ( ( value ) << UOTGHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos ) ) )
/* -------- UOTGHS_HSTDMAADDRESS : (UOTGHS Offset: N/A) Host DMA Channel Address Register -------- */
#define UOTGHS_HSTDMAADDRESS_BUFF_ADD_Pos                0
#define UOTGHS_HSTDMAADDRESS_BUFF_ADD_Msk                ( 0xffffffffu << UOTGHS_HSTDMAADDRESS_BUFF_ADD_Pos ) /**< \brief (UOTGHS_HSTDMAADDRESS) Buffer Address */
#define UOTGHS_HSTDMAADDRESS_BUFF_ADD( value )    ( ( UOTGHS_HSTDMAADDRESS_BUFF_ADD_Msk & ( ( value ) << UOTGHS_HSTDMAADDRESS_BUFF_ADD_Pos ) ) )
/* -------- UOTGHS_HSTDMACONTROL : (UOTGHS Offset: N/A) Host DMA Channel Control Register -------- */
#define UOTGHS_HSTDMACONTROL_CHANN_ENB                   ( 0x1u << 0 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) Channel Enable Command */
#define UOTGHS_HSTDMACONTROL_LDNXT_DSC                   ( 0x1u << 1 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command */
#define UOTGHS_HSTDMACONTROL_END_TR_EN                   ( 0x1u << 2 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) End of Transfer Enable (Control) */
#define UOTGHS_HSTDMACONTROL_END_B_EN                    ( 0x1u << 3 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) End of Buffer Enable Control */
#define UOTGHS_HSTDMACONTROL_END_TR_IT                   ( 0x1u << 4 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) End of Transfer Interrupt Enable */
