FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_uotghs.h
#define UOTGHS_HSTDMACONTROL_END_BUFFIT                  ( 0x1u << 5 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) End of Buffer Interrupt Enable */
#define UOTGHS_HSTDMACONTROL_DESC_LD_IT                  ( 0x1u << 6 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable */
#define UOTGHS_HSTDMACONTROL_BURST_LCK                   ( 0x1u << 7 )                                       /**< \brief (UOTGHS_HSTDMACONTROL) Burst Lock Enable */
#define UOTGHS_HSTDMACONTROL_BUFF_LENGTH_Pos             16
#define UOTGHS_HSTDMACONTROL_BUFF_LENGTH_Msk             ( 0xffffu << UOTGHS_HSTDMACONTROL_BUFF_LENGTH_Pos ) /**< \brief (UOTGHS_HSTDMACONTROL) Buffer Byte Length (Write-only) */
#define UOTGHS_HSTDMACONTROL_BUFF_LENGTH( value )    ( ( UOTGHS_HSTDMACONTROL_BUFF_LENGTH_Msk & ( ( value ) << UOTGHS_HSTDMACONTROL_BUFF_LENGTH_Pos ) ) )
/* -------- UOTGHS_HSTDMASTATUS : (UOTGHS Offset: N/A) Host DMA Channel Status Register -------- */
#define UOTGHS_HSTDMASTATUS_CHANN_ENB                    ( 0x1u << 0 )                                     /**< \brief (UOTGHS_HSTDMASTATUS) Channel Enable Status */
#define UOTGHS_HSTDMASTATUS_CHANN_ACT                    ( 0x1u << 1 )                                     /**< \brief (UOTGHS_HSTDMASTATUS) Channel Active Status */
#define UOTGHS_HSTDMASTATUS_END_TR_ST                    ( 0x1u << 4 )                                     /**< \brief (UOTGHS_HSTDMASTATUS) End of Channel Transfer Status */
#define UOTGHS_HSTDMASTATUS_END_BF_ST                    ( 0x1u << 5 )                                     /**< \brief (UOTGHS_HSTDMASTATUS) End of Channel Buffer Status */
#define UOTGHS_HSTDMASTATUS_DESC_LDST                    ( 0x1u << 6 )                                     /**< \brief (UOTGHS_HSTDMASTATUS) Descriptor Loaded Status */
#define UOTGHS_HSTDMASTATUS_BUFF_COUNT_Pos               16
#define UOTGHS_HSTDMASTATUS_BUFF_COUNT_Msk               ( 0xffffu << UOTGHS_HSTDMASTATUS_BUFF_COUNT_Pos ) /**< \brief (UOTGHS_HSTDMASTATUS) Buffer Byte Count */
#define UOTGHS_HSTDMASTATUS_BUFF_COUNT( value )    ( ( UOTGHS_HSTDMASTATUS_BUFF_COUNT_Msk & ( ( value ) << UOTGHS_HSTDMASTATUS_BUFF_COUNT_Pos ) ) )
/* -------- UOTGHS_CTRL : (UOTGHS Offset: 0x0800) General Control Register -------- */
#define UOTGHS_CTRL_IDTE                                 ( 0x1u << 0 )                        /**< \brief (UOTGHS_CTRL) ID Transition Interrupt Enable */
#define UOTGHS_CTRL_VBUSTE                               ( 0x1u << 1 )                        /**< \brief (UOTGHS_CTRL) VBus Transition Interrupt Enable */
#define UOTGHS_CTRL_SRPE                                 ( 0x1u << 2 )                        /**< \brief (UOTGHS_CTRL) SRP Interrupt Enable */
#define UOTGHS_CTRL_VBERRE                               ( 0x1u << 3 )                        /**< \brief (UOTGHS_CTRL) VBus Error Interrupt Enable */
#define UOTGHS_CTRL_BCERRE                               ( 0x1u << 4 )                        /**< \brief (UOTGHS_CTRL) B-Connection Error Interrupt Enable */
#define UOTGHS_CTRL_ROLEEXE                              ( 0x1u << 5 )                        /**< \brief (UOTGHS_CTRL) Role Exchange Interrupt Enable */
#define UOTGHS_CTRL_HNPERRE                              ( 0x1u << 6 )                        /**< \brief (UOTGHS_CTRL) HNP Error Interrupt Enable */
#define UOTGHS_CTRL_STOE                                 ( 0x1u << 7 )                        /**< \brief (UOTGHS_CTRL) Suspend Time-Out Interrupt Enable */
#define UOTGHS_CTRL_VBUSHWC                              ( 0x1u << 8 )                        /**< \brief (UOTGHS_CTRL) VBus Hardware Control */
#define UOTGHS_CTRL_SRPSEL                               ( 0x1u << 9 )                        /**< \brief (UOTGHS_CTRL) SRP Selection */
#define UOTGHS_CTRL_SRPREQ                               ( 0x1u << 10 )                       /**< \brief (UOTGHS_CTRL) SRP Request */
#define UOTGHS_CTRL_HNPREQ                               ( 0x1u << 11 )                       /**< \brief (UOTGHS_CTRL) HNP Request */
#define UOTGHS_CTRL_OTGPADE                              ( 0x1u << 12 )                       /**< \brief (UOTGHS_CTRL) OTG Pad Enable */
#define UOTGHS_CTRL_VBUSPO                               ( 0x1u << 13 )                       /**< \brief (UOTGHS_CTRL) VBus Polarity Off */
#define UOTGHS_CTRL_FRZCLK                               ( 0x1u << 14 )                       /**< \brief (UOTGHS_CTRL) Freeze USB Clock */
#define UOTGHS_CTRL_USBE                                 ( 0x1u << 15 )                       /**< \brief (UOTGHS_CTRL) UOTGHS Enable */
#define UOTGHS_CTRL_TIMVALUE_Pos                         16
#define UOTGHS_CTRL_TIMVALUE_Msk                         ( 0x3u << UOTGHS_CTRL_TIMVALUE_Pos ) /**< \brief (UOTGHS_CTRL) Timer Value */
#define UOTGHS_CTRL_TIMVALUE( value )    ( ( UOTGHS_CTRL_TIMVALUE_Msk & ( ( value ) << UOTGHS_CTRL_TIMVALUE_Pos ) ) )
#define UOTGHS_CTRL_TIMPAGE_Pos                          20
#define UOTGHS_CTRL_TIMPAGE_Msk                          ( 0x3u << UOTGHS_CTRL_TIMPAGE_Pos ) /**< \brief (UOTGHS_CTRL) Timer Page */
#define UOTGHS_CTRL_TIMPAGE( value )     ( ( UOTGHS_CTRL_TIMPAGE_Msk & ( ( value ) << UOTGHS_CTRL_TIMPAGE_Pos ) ) )
#define UOTGHS_CTRL_UNLOCK                               ( 0x1u << 22 )                      /**< \brief (UOTGHS_CTRL) Timer Access Unlock */
#define UOTGHS_CTRL_UIDE                                 ( 0x1u << 24 )                      /**< \brief (UOTGHS_CTRL) UOTGID Pin Enable */
#define   UOTGHS_CTRL_UIDE_UIMOD                         ( 0x0u << 24 )                      /**< \brief (UOTGHS_CTRL) The USB mode (device/host) is selected from the UIMOD bit. */
#define   UOTGHS_CTRL_UIDE_UOTGID                        ( 0x1u << 24 )                      /**< \brief (UOTGHS_CTRL) The USB mode (device/host) is selected from the UOTGID input pin. */
#define UOTGHS_CTRL_UIMOD                                ( 0x1u << 25 )                      /**< \brief (UOTGHS_CTRL) UOTGHS Mode */
#define   UOTGHS_CTRL_UIMOD_HOST                         ( 0x0u << 25 )                      /**< \brief (UOTGHS_CTRL) The module is in USB host mode. */
#define   UOTGHS_CTRL_UIMOD_DEVICE                       ( 0x1u << 25 )                      /**< \brief (UOTGHS_CTRL) The module is in USB device mode. */
/* -------- UOTGHS_SR : (UOTGHS Offset: 0x0804) General Status Register -------- */
#define UOTGHS_SR_IDTI                                   ( 0x1u << 0 )                       /**< \brief (UOTGHS_SR) ID Transition Interrupt */
#define UOTGHS_SR_VBUSTI                                 ( 0x1u << 1 )                       /**< \brief (UOTGHS_SR) VBus Transition Interrupt */
#define UOTGHS_SR_SRPI                                   ( 0x1u << 2 )                       /**< \brief (UOTGHS_SR) SRP Interrupt */
#define UOTGHS_SR_VBERRI                                 ( 0x1u << 3 )                       /**< \brief (UOTGHS_SR) VBus Error Interrupt */
#define UOTGHS_SR_BCERRI                                 ( 0x1u << 4 )                       /**< \brief (UOTGHS_SR) B-Connection Error Interrupt */
#define UOTGHS_SR_ROLEEXI                                ( 0x1u << 5 )                       /**< \brief (UOTGHS_SR) Role Exchange Interrupt */
#define UOTGHS_SR_HNPERRI                                ( 0x1u << 6 )                       /**< \brief (UOTGHS_SR) HNP Error Interrupt */
#define UOTGHS_SR_STOI                                   ( 0x1u << 7 )                       /**< \brief (UOTGHS_SR) Suspend Time-Out Interrupt */
#define UOTGHS_SR_VBUSRQ                                 ( 0x1u << 9 )                       /**< \brief (UOTGHS_SR) VBus Request */
#define UOTGHS_SR_ID                                     ( 0x1u << 10 )                      /**< \brief (UOTGHS_SR) UOTGID Pin State */
#define UOTGHS_SR_VBUS                                   ( 0x1u << 11 )                      /**< \brief (UOTGHS_SR) VBus Level */
#define UOTGHS_SR_SPEED_Pos                              12
#define UOTGHS_SR_SPEED_Msk                              ( 0x3u << UOTGHS_SR_SPEED_Pos )     /**< \brief (UOTGHS_SR) Speed Status */
#define   UOTGHS_SR_SPEED_FULL_SPEED                     ( 0x0u << 12 )                      /**< \brief (UOTGHS_SR) Full-Speed mode */
#define   UOTGHS_SR_SPEED_HIGH_SPEED                     ( 0x1u << 12 )                      /**< \brief (UOTGHS_SR) High-Speed mode */
#define   UOTGHS_SR_SPEED_LOW_SPEED                      ( 0x2u << 12 )                      /**< \brief (UOTGHS_SR) Low-Speed mode */
#define UOTGHS_SR_CLKUSABLE                              ( 0x1u << 14 )                      /**< \brief (UOTGHS_SR) UTMI Clock Usable */
/* -------- UOTGHS_SCR : (UOTGHS Offset: 0x0808) General Status Clear Register -------- */
#define UOTGHS_SCR_IDTIC                                 ( 0x1u << 0 )                       /**< \brief (UOTGHS_SCR) ID Transition Interrupt Clear */
#define UOTGHS_SCR_VBUSTIC                               ( 0x1u << 1 )                       /**< \brief (UOTGHS_SCR) VBus Transition Interrupt Clear */
#define UOTGHS_SCR_SRPIC                                 ( 0x1u << 2 )                       /**< \brief (UOTGHS_SCR) SRP Interrupt Clear */
#define UOTGHS_SCR_VBERRIC                               ( 0x1u << 3 )                       /**< \brief (UOTGHS_SCR) VBus Error Interrupt Clear */
#define UOTGHS_SCR_BCERRIC                               ( 0x1u << 4 )                       /**< \brief (UOTGHS_SCR) B-Connection Error Interrupt Clear */
#define UOTGHS_SCR_ROLEEXIC                              ( 0x1u << 5 )                       /**< \brief (UOTGHS_SCR) Role Exchange Interrupt Clear */
#define UOTGHS_SCR_HNPERRIC                              ( 0x1u << 6 )                       /**< \brief (UOTGHS_SCR) HNP Error Interrupt Clear */
#define UOTGHS_SCR_STOIC                                 ( 0x1u << 7 )                       /**< \brief (UOTGHS_SCR) Suspend Time-Out Interrupt Clear */
#define UOTGHS_SCR_VBUSRQC                               ( 0x1u << 9 )                       /**< \brief (UOTGHS_SCR) VBus Request Clear */
/* -------- UOTGHS_SFR : (UOTGHS Offset: 0x080C) General Status Set Register -------- */
#define UOTGHS_SFR_IDTIS                                 ( 0x1u << 0 )                       /**< \brief (UOTGHS_SFR) ID Transition Interrupt Set */
#define UOTGHS_SFR_VBUSTIS                               ( 0x1u << 1 )                       /**< \brief (UOTGHS_SFR) VBus Transition Interrupt Set */
#define UOTGHS_SFR_SRPIS                                 ( 0x1u << 2 )                       /**< \brief (UOTGHS_SFR) SRP Interrupt Set */
#define UOTGHS_SFR_VBERRIS                               ( 0x1u << 3 )                       /**< \brief (UOTGHS_SFR) VBus Error Interrupt Set */
#define UOTGHS_SFR_BCERRIS                               ( 0x1u << 4 )                       /**< \brief (UOTGHS_SFR) B-Connection Error Interrupt Set */
#define UOTGHS_SFR_ROLEEXIS                              ( 0x1u << 5 )                       /**< \brief (UOTGHS_SFR) Role Exchange Interrupt Set */
#define UOTGHS_SFR_HNPERRIS                              ( 0x1u << 6 )                       /**< \brief (UOTGHS_SFR) HNP Error Interrupt Set */
#define UOTGHS_SFR_STOIS                                 ( 0x1u << 7 )                       /**< \brief (UOTGHS_SFR) Suspend Time-Out Interrupt Set */
#define UOTGHS_SFR_VBUSRQS                               ( 0x1u << 9 )                       /**< \brief (UOTGHS_SFR) VBus Request Set */
/* -------- UOTGHS_TSTA1 : (UOTGHS Offset: 0x0810) General Test A1 Register -------- */
#define UOTGHS_TSTA1_CounterA_Pos                        0
#define UOTGHS_TSTA1_CounterA_Msk                        ( 0x7fffu << UOTGHS_TSTA1_CounterA_Pos ) /**< \brief (UOTGHS_TSTA1) Load CounterA */
#define UOTGHS_TSTA1_CounterA( value )    ( ( UOTGHS_TSTA1_CounterA_Msk & ( ( value ) << UOTGHS_TSTA1_CounterA_Pos ) ) )
#define UOTGHS_TSTA1_LoadCntA                            ( 0x1u << 15 )                           /**< \brief (UOTGHS_TSTA1) Load CounterA */
#define UOTGHS_TSTA1_CounterB_Pos                        16
#define UOTGHS_TSTA1_CounterB_Msk                        ( 0x3fu << UOTGHS_TSTA1_CounterB_Pos )   /**< \brief (UOTGHS_TSTA1) Load CounterB */
#define UOTGHS_TSTA1_CounterB( value )    ( ( UOTGHS_TSTA1_CounterB_Msk & ( ( value ) << UOTGHS_TSTA1_CounterB_Pos ) ) )
#define UOTGHS_TSTA1_LoadCntB                            ( 0x1u << 23 )                           /**< \brief (UOTGHS_TSTA1) Load CounterB */
#define UOTGHS_TSTA1_SOFCntMa1_Pos                       24
#define UOTGHS_TSTA1_SOFCntMa1_Msk                       ( 0x7fu << UOTGHS_TSTA1_SOFCntMa1_Pos )  /**< \brief (UOTGHS_TSTA1) SOF Counter Max */
#define UOTGHS_TSTA1_SOFCntMa1( value )    ( ( UOTGHS_TSTA1_SOFCntMa1_Msk & ( ( value ) << UOTGHS_TSTA1_SOFCntMa1_Pos ) ) )
#define UOTGHS_TSTA1_LoadSOFCnt                          ( 0x1u << 31 )                           /**< \brief (UOTGHS_TSTA1) Load SOF Counter */
/* -------- UOTGHS_TSTA2 : (UOTGHS Offset: 0x0814) General Test A2 Register -------- */
#define UOTGHS_TSTA2_FullDetachEn                        ( 0x1u << 0 )                            /**< \brief (UOTGHS_TSTA2) Full Detach Enable */
#define UOTGHS_TSTA2_HSSerialMode                        ( 0x1u << 1 )                            /**< \brief (UOTGHS_TSTA2) HS Serial Mode */
#define UOTGHS_TSTA2_LoopBackMode                        ( 0x1u << 2 )                            /**< \brief (UOTGHS_TSTA2) Loop-back Mode */
#define UOTGHS_TSTA2_DisableGatedClock                   ( 0x1u << 3 )                            /**< \brief (UOTGHS_TSTA2) Disable Gated Clock */
#define UOTGHS_TSTA2_ForceSuspendMTo1                    ( 0x1u << 4 )                            /**< \brief (UOTGHS_TSTA2) Force SuspendM to 1 */
#define UOTGHS_TSTA2_ByPassDpll                          ( 0x1u << 5 )                            /**< \brief (UOTGHS_TSTA2) Bypass DPLL */
#define UOTGHS_TSTA2_HostHSDisconnectDisable             ( 0x1u << 6 )                            /**< \brief (UOTGHS_TSTA2) Host HS Disconnect Disable */
#define UOTGHS_TSTA2_ForceHSRst_50ms                     ( 0x1u << 7 )                            /**< \brief (UOTGHS_TSTA2) Force HS Reset to 50 ms */
#define UOTGHS_TSTA2_UTMIReset                           ( 0x1u << 8 )                            /**< \brief (UOTGHS_TSTA2) UTMI Reset */
#define UOTGHS_TSTA2_RemovePUWhenTX                      ( 0x1u << 9 )                            /**< \brief (UOTGHS_TSTA2) Remove Pull-up When TX */
/* -------- UOTGHS_VERSION : (UOTGHS Offset: 0x0818) General Version Register -------- */
#define UOTGHS_VERSION_VERSION_Pos                       0
#define UOTGHS_VERSION_VERSION_Msk                       ( 0xfffu << UOTGHS_VERSION_VERSION_Pos ) /**< \brief (UOTGHS_VERSION) Version Number */
#define UOTGHS_VERSION_VARIANT_Pos                       16
#define UOTGHS_VERSION_VARIANT_Msk                       ( 0xfu << UOTGHS_VERSION_VARIANT_Pos )   /**< \brief (UOTGHS_VERSION) Variant Number */
/* -------- UOTGHS_FEATURES : (UOTGHS Offset: 0x081C) General Features Register -------- */
#define UOTGHS_FEATURES_EPTNBRMAX_Pos                    0
#define UOTGHS_FEATURES_EPTNBRMAX_Msk                    ( 0xfu << UOTGHS_FEATURES_EPTNBRMAX_Pos )        /**< \brief (UOTGHS_FEATURES) Maximal Number of Pipes/Endpoints */
#define   UOTGHS_FEATURES_EPTNBRMAX_16_P_E               ( 0x0u << 0 )                                    /**< \brief (UOTGHS_FEATURES) 16 pipes/endpoints */
#define   UOTGHS_FEATURES_EPTNBRMAX_1_P_E                ( 0x1u << 0 )                                    /**< \brief (UOTGHS_FEATURES) 1 pipe/endpoint */
#define   UOTGHS_FEATURES_EPTNBRMAX_2_P_E                ( 0x2u << 0 )                                    /**< \brief (UOTGHS_FEATURES) 2 pipes/endpoints */
#define   UOTGHS_FEATURES_EPTNBRMAX_15_P_E               ( 0xFu << 0 )                                    /**< \brief (UOTGHS_FEATURES) 15 pipes/endpoints */
#define UOTGHS_FEATURES_DMACHANNELNBR_Pos                4
#define UOTGHS_FEATURES_DMACHANNELNBR_Msk                ( 0x7u << UOTGHS_FEATURES_DMACHANNELNBR_Pos )    /**< \brief (UOTGHS_FEATURES) Number of DMA Channels */
#define   UOTGHS_FEATURES_DMACHANNELNBR_1_DMA_CH         ( 0x1u << 4 )                                    /**< \brief (UOTGHS_FEATURES) 1 DMA channel */
#define   UOTGHS_FEATURES_DMACHANNELNBR_2_DMA_CH         ( 0x2u << 4 )                                    /**< \brief (UOTGHS_FEATURES) 2 DMA channels */
#define   UOTGHS_FEATURES_DMACHANNELNBR_7_DMA_CH         ( 0x7u << 4 )                                    /**< \brief (UOTGHS_FEATURES) 7 DMA channels */
#define UOTGHS_FEATURES_DMABUFFERSIZE                    ( 0x1u << 7 )                                    /**< \brief (UOTGHS_FEATURES) DMA Buffer Size */
#define UOTGHS_FEATURES_DMAFIFOWORDDEPTH_Pos             8
#define UOTGHS_FEATURES_DMAFIFOWORDDEPTH_Msk             ( 0xfu << UOTGHS_FEATURES_DMAFIFOWORDDEPTH_Pos ) /**< \brief (UOTGHS_FEATURES) DMA FIFO Depth in Words */
#define   UOTGHS_FEATURES_DMAFIFOWORDDEPTH_16_DMA_F_D    ( 0x0u << 8 )                                    /**< \brief (UOTGHS_FEATURES) 16 DMA FIFO depth */
#define   UOTGHS_FEATURES_DMAFIFOWORDDEPTH_1_DMA_F_D     ( 0x1u << 8 )                                    /**< \brief (UOTGHS_FEATURES) 1 DMA FIFO depth */
#define   UOTGHS_FEATURES_DMAFIFOWORDDEPTH_2_DMA_F_D     ( 0x2u << 8 )                                    /**< \brief (UOTGHS_FEATURES) 2 DMA FIFO depth */
#define   UOTGHS_FEATURES_DMAFIFOWORDDEPTH_15_DMA_F_D    ( 0xFu << 8 )                                    /**< \brief (UOTGHS_FEATURES) 15 DMA FIFO depth */
#define UOTGHS_FEATURES_FIFOMAXSIZE_Pos                  12
#define UOTGHS_FEATURES_FIFOMAXSIZE_Msk                  ( 0x7u << UOTGHS_FEATURES_FIFOMAXSIZE_Pos )      /**< \brief (UOTGHS_FEATURES) Maximal FIFO Size */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_256_BYTE           ( 0x0u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 256 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_512_BYTE           ( 0x1u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 512 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_1024_BYTE          ( 0x2u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 1024 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_2048_BYTE          ( 0x3u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 2048 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_4096_BYTE          ( 0x4u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 4096 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_8192_BYTE          ( 0x5u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 8192 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_16384_BYTE         ( 0x6u << 12 )                                   /**< \brief (UOTGHS_FEATURES) < 16384 bytes */
#define   UOTGHS_FEATURES_FIFOMAXSIZE_P16384_BYTE        ( 0x7u << 12 )                                   /**< \brief (UOTGHS_FEATURES) >= 16384 bytes */
#define UOTGHS_FEATURES_BYTEWRITEDPRAM                   ( 0x1u << 15 )                                   /**< \brief (UOTGHS_FEATURES) DPRAM Byte-Write Capability */
#define UOTGHS_FEATURES_DATABUS                          ( 0x1u << 16 )                                   /**< \brief (UOTGHS_FEATURES) Data Bus 16-8 */
#define UOTGHS_FEATURES_ENHBISO1                         ( 0x1u << 17 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 1 */
#define UOTGHS_FEATURES_ENHBISO2                         ( 0x1u << 18 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 2 */
#define UOTGHS_FEATURES_ENHBISO3                         ( 0x1u << 19 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 3 */
#define UOTGHS_FEATURES_ENHBISO4                         ( 0x1u << 20 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 4 */
#define UOTGHS_FEATURES_ENHBISO5                         ( 0x1u << 21 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 5 */
#define UOTGHS_FEATURES_ENHBISO6                         ( 0x1u << 22 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 6 */
#define UOTGHS_FEATURES_ENHBISO7                         ( 0x1u << 23 )                                   /**< \brief (UOTGHS_FEATURES) High Bandwidth Isochronous Feature for Endpoint 7 */
/* -------- UOTGHS_ADDRSIZE : (UOTGHS Offset: 0x0820) General APB Address Size Register -------- */
#define UOTGHS_ADDRSIZE_UOTGHS_ADDRSIZE_Pos              0
#define UOTGHS_ADDRSIZE_UOTGHS_ADDRSIZE_Msk              ( 0xffffffffu << UOTGHS_ADDRSIZE_UOTGHS_ADDRSIZE_Pos ) /**< \brief (UOTGHS_ADDRSIZE) IP APB Address Size */
/* -------- UOTGHS_IPNAME1 : (UOTGHS Offset: 0x0824) General Name Register 1 -------- */
#define UOTGHS_IPNAME1_UOTGHS_IPNAME1_Pos                0
#define UOTGHS_IPNAME1_UOTGHS_IPNAME1_Msk                ( 0xffffffffu << UOTGHS_IPNAME1_UOTGHS_IPNAME1_Pos ) /**< \brief (UOTGHS_IPNAME1) IP Name Part One */
/* -------- UOTGHS_IPNAME2 : (UOTGHS Offset: 0x0828) General Name Register 2 -------- */
#define UOTGHS_IPNAME2_UOTGHS_IPNAME2_Pos                0
#define UOTGHS_IPNAME2_UOTGHS_IPNAME2_Msk                ( 0xffffffffu << UOTGHS_IPNAME2_UOTGHS_IPNAME2_Pos ) /**< \brief (UOTGHS_IPNAME2) IP Name Part Two */
/* -------- UOTGHS_FSM : (UOTGHS Offset: 0x082C) General Finite State Machine Register -------- */
#define UOTGHS_FSM_DRDSTATE_Pos                          0
#define UOTGHS_FSM_DRDSTATE_Msk                          ( 0xfu << UOTGHS_FSM_DRDSTATE_Pos ) /**< \brief (UOTGHS_FSM) Dual Role Device State */
#define   UOTGHS_FSM_DRDSTATE_A_IDLESTATE                ( 0x0u << 0 )                       /**< \brief (UOTGHS_FSM) This is the start state for A-devices (when the ID pin is 0) */
#define   UOTGHS_FSM_DRDSTATE_A_WAIT_VRISE               ( 0x1u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V). */
#define   UOTGHS_FSM_DRDSTATE_A_WAIT_BCON                ( 0x2u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device waits for the B-device to signal a connection. */
#define   UOTGHS_FSM_DRDSTATE_A_HOST                     ( 0x3u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device that operates in Host mode is operational. */
#define   UOTGHS_FSM_DRDSTATE_A_SUSPEND                  ( 0x4u << 0 )                       /**< \brief (UOTGHS_FSM) The A-device operating as a host is in the suspend mode. */
#define   UOTGHS_FSM_DRDSTATE_A_PERIPHERAL               ( 0x5u << 0 )                       /**< \brief (UOTGHS_FSM) The A-device operates as a peripheral. */
#define   UOTGHS_FSM_DRDSTATE_A_WAIT_VFALL               ( 0x6u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V). */
#define   UOTGHS_FSM_DRDSTATE_A_VBUS_ERR                 ( 0x7u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state. */
#define   UOTGHS_FSM_DRDSTATE_A_WAIT_DISCHARGE           ( 0x8u << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us). */
#define   UOTGHS_FSM_DRDSTATE_B_IDLE                     ( 0x9u << 0 )                       /**< \brief (UOTGHS_FSM) This is the start state for B-device (when the ID pin is 1). */
#define   UOTGHS_FSM_DRDSTATE_B_PERIPHERAL               ( 0xAu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device acts as the peripheral. */
#define   UOTGHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP           ( 0xBu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device is in suspend mode and waits until 3 ms before initiating the HNP protocol if requested. */
#define   UOTGHS_FSM_DRDSTATE_B_WAIT_DISCHARGE           ( 0xCu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us) before becoming Host. */
#define   UOTGHS_FSM_DRDSTATE_B_WAIT_ACON                ( 0xDu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host. */
#define   UOTGHS_FSM_DRDSTATE_B_HOST                     ( 0xEu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device acts as the Host. */
#define   UOTGHS_FSM_DRDSTATE_B_SRP_INIT                 ( 0xFu << 0 )                       /**< \brief (UOTGHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol. */

/*@}*/


#endif /* _SAM_UOTGHS_COMPONENT_ */
